[{"The Roosevelt Room": {"name": "The Roosevelt Room", "price": "$$", "ratings": {"2016": [5.0, 5.0, 4.5, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 4.5, 4.5, 4.5], "2017": [5.0, 4.5, 4.5, 4.5, 4.5, 5.0, 5.0, 4.5, 4.5, 4.5, 4.5, 4.0], "2018": [4.0, 4.5, 4.0, 4.0, 4.5, 5.0, 4.5, 4.0, 3.5, 5.0, 4.0, 4.5], "2019": [4.5, 4.5, 4.5, 4.5, 4.5, 4.0, 4.0, 4.5], "2015": [5.0, 5.0, 5.0, 4.5]}, "hours": [{"Mon": "4:00 pm - 2:00 am"}, {"Tue": "4:00 pm - 2:00 am"}, {"Wed": "4:00 pm - 2:00 am"}, {"Thu": "4:00 pm - 2:00 am"}, {"Fri": "4:00 pm - 2:00 am"}, {"Sat": "4:00 pm - 2:00 am"}, {"Sun": "3:00 pm - 12:00 am"}], "info": {"Group Bookings": "Yes", "Happy Hour Specials": "Yes", "Takes Reservations": "Yes", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No", "Parking": "Garage, Street", "Bike Parking": "Yes", "Wheelchair Accessible": "Yes", "Good for Kids": "No", "Good for Groups": "Yes", "Attire": "Casual", "Ambience": "Trendy, Intimate, Romantic, Classy, Upscale", "Noise Level": "Average", "Good For Dancing": "No", "Alcohol": "Full Bar", "Good For Happy Hour": "Yes", "Best Nights": "Thu, Fri, Sat", "Coat Check": "No", "Smoking": "Outdoor Area / Patio Only", "Outdoor Seating": "No", "Wi-Fi": "Free", "Has TV": "No", "Dogs Allowed": "No", "By Appointment Only": "No", "Has Pool Table": "No"}, "reviews": [{"date": "8/11/2019", "rating": 5.0, "content": "What an experience!!! Hands down...the best intimate specialty coctail bar/lounge I've ever been. I wish there was one in Houston!"}, {"date": "8/8/2019", "rating": 5.0, "content": "Great mixology and choice of classic drinks. Good for a business meeting without the food but they open at 4:00 pm"}, {"date": "8/4/2019", "rating": 2.0, "content": "Would have given this place one star if our waitress Hirrah sucked, but she was hands down the best part of this \"bar.\"Have you ever been to a BAR where you are asked to be quiet? I sure haven't until Joy, who is apparently the manager of the restaurant did. Mind you, the restaurant was loud and packed full of people and by no means were we being louder than our usual. We actually hit up 5 other bars the same night and never was once asked to be quiet. Joy actually humiliated our server and was extremely unprofessional. Joy came up to us while our server was at our table and asked us to be quiet. She then proceeded to discipline our server in front of us, making it uncomfortable for her and us. Joy basically was pissed because Hirrah our server didn't tell us to be quiet and she had to do it...one we weren't loud until she said something and continued to walk by our table and glare at us. She walked by 4 times within a 15 minute timeframe glaring. What kind of manager does that? If I were the owner I would re-evaluate who is managing the place cause you're gonna lose good people like Hirrah. Other than that, the food was delicious, drinks were also great. Being a visitor of Austin, I probably would not suggest coming here because of Joy. Her unprofessionalism was uncalled for."}, {"date": "8/3/2019", "rating": 5.0, "content": "Great speak-easy and bar menu. It's a unique signature place to have some incredible cocktails. They know how to make it right: from all era's of time, they mix their cocktails to suit your style.I couldn't find a bad thing about these drinks. The decor is beautiful, and the staff is absolute top notch. They consistently checked in with me. Gave me some vast knowledge of the restaurant/bar. There are more than 50 mixed cocktails, and over 20 unique signature concoctions that the owner came out with. So much more to write about this restaurant and the menu, but it's something you need to come and see for yourself. Come thirsty and hungry, because it's definitely worth the visit!"}, {"date": "7/29/2019", "rating": 5.0, "content": "This place is awesome! I highly recommend the Roosevelt Room. It had a great vibe with really cool paintings on exposed brick. Sharon was so amazing. Every cocktail that she made looked amazing and tasted even better. She also had a great vibe about her and she was very enthusiastic and passionate about her craft.  You will love this place!"}, {"date": "7/28/2019", "rating": 5.0, "content": "Had cocktails at The Roosevelt Room on Monday night. Wonderful environment to enjoy some well crafted and delicious drinks.Quality: The Roosevelt Room is the spot for cocktails in Austin. With a menu listing nearly 75 options, some house creations, others classic cocktails, there is something for everyone. And if you still can't find anything, the bartenders will put something together for you. Do not hesitate to take advantage of their knowledge, as they can provide guidance to get you exactly what you are looking for. On this evening I tried a Butterbean, a Black Mountain Coffee, and a Coconut Daiquiri. All three were solid drinks, expertly crafted, and beautifully presented.Quantity: Depends on the drink, some are just a few sips, others a solid pour.Value: The majority of cocktails ranged from $13 to $20.Ambiance: The Roosevelt Room is located in Downtown Austin. With a bit of separation from the rest of the Austin bar scene, The Roosevelt Room is a more elegant and stylish spot. As you push past the curtains you enter a dimly lit lounge. Black couches populate the right side and a long bar occupies the left. Black and white paintings decorate the walls, and a screen hung down showing episodes of Twin Peaks. Jazz and traditional pop filled the air, and we were informed live jazz takes over on Thursday. It is an intimate setting, one you almost feel like you should be dressed up to visit.Crowd: Even on a Monday night, nearly every seat in the house was full. Expect to see lots of couples on dates.Service: Bartenders that don't mess around when it comes to quality drinks.Parking: Limited street parking and nearby parking garages."}, {"date": "7/27/2019", "rating": 5.0, "content": "Went to the Roosevelt Room on Friday night around 6:30 for happy. We didn't have a reservation and didn't have to wait to sit at the long table/bar. The vibe/ inside decor is so so cool. There are pictures of Teddy and Eleanor on the walls and old books everywhere which is super fun. The menu is a little overwhelming at first but the waiters are super helpful and walk you through everything. We tried 1 alcoholic and 1 non-alcoholic and they were both amazing! Super nice spot the chill before going out or going to dinner."}, {"date": "7/22/2019", "rating": 5.0, "content": "Simply put - this place it awesome. Old-time speakeasy with a deep, expansive menu. If you can't find a drink here then maybe you're doing it wrong. The menus deep, varied, and delicious. There's something for everyone here. Within each drink category it starts mellow and gets progressively boozy. For me the Volstead (1933-1950's) was the sweet spot. The Millionaire was incredible! Went back for the Tiki (1950-1970's) Jungle Bird, you've never had anything like this. Modern Classics (2000s - present) Naked and Famous should be famous. And the Oaxaca Old Fashion is a mole twist on the tried and true old fashioned. Make plans, make a reservation and go. It's worth. Did I mention they play classic movies too! Yes please."}, {"date": "7/19/2019", "rating": 5.0, "content": "This is the best bar in Austin, hands down. Drinks are pricey but amazing and parking can be a bit tough but it's downtown Austin so you can't expect anything less. Great happy hour, awesome drinks an bartenders, just awesome."}, {"date": "7/16/2019", "rating": 5.0, "content": "Great vibe and amazing drinks! $7 cocktails at happy hour (and all day Mon/Tues) brings luxury without crazy prices."}, {"date": "7/10/2019", "rating": 1.0, "content": "The drinks are way overpriced, the staff was slow and inattentive, and the food (if you can call it that) was a joke. Paaaaaasss"}, {"date": "7/6/2019", "rating": 5.0, "content": "Well, I love cocktails and this place is now one of my favorite cocktail bars. Anywhere. The atmosphere sets the tone for this place. You either need a reservation or patience to get in. We had the latter. Once in it like a old speakeasy. With a cocktail menu that is ordered by eras and each era ordered by strength. If you can, sit at the bar or in view. The best show in the house is watching a bartender craft these special drinks. It really is awe inspiring. But don't be in a hurry. These take some time and the place is packed. Be patient and order the next round a little early."}, {"date": "7/4/2019", "rating": 5.0, "content": "I stopped by The Roosevelt Room rather quickly and on a whim a couple nights back. From getting in, to being seated at the bar, the entire experience was wonderful. The atmosphere was speakeasy chic, but casual and the bartenders were incredibly friendly and knowledgeable. The selections were expansive. They had a board of cocktails that walk you through eras and have so many things that you've never had. I asked Eric (on of the folks on staff)  to make something he thought was great and he asked some insightful questions and delivered a VERY good cocktail. I'd say it's a good place for a date and a good places to be with good friends, especially if you are tired of other Austin watering holes. The atmosphere, service, and goods are....well good. I'll be back every time in in town and their open."}, {"date": "6/25/2019", "rating": 1.0, "content": "This place used to be my favorite bar/lounge in Austin. Until they changed it to no-walk ins (even though there are tons of seats available, it's just an attempt to crest exclusivity). Once that happened I've never been able to get a seat and I've crossed it off my list permanently."}, {"date": "6/24/2019", "rating": 5.0, "content": "Really solid bar. Dark and makes for a simple and old school atmosphere. Cocktail game hits all the good stuff and some house concoctions. Happy Hour until 7pm for $7 specials and half off bubbles on Sundays. Can get expensive if you want to go with big liquors but a classic cocktail is about $14 which is reasonable considering these bartenders are top of the line and know their stuff. Had an old fashioned and really just a very good rendition  easy to just sit here and sip for a few hours with not too much hassle. Can get loud and have one projector, but if you go earlier in day the bar will be all yours. I will be back late night and test out some of the classics for sure."}, {"date": "6/13/2019", "rating": 1.0, "content": "If you have a work function and you want to use this for happy hour, DON'T BOTHER. We had a reservation for 6 people that started around happy hour time. We arrived at about 5pm and we were told to leave our table at 7pm so that another party with a reservation could take it - we had finished drinks and were about to order dinner. So, basically, this places treats you like riffraff if you make a reservation for happy hour. Absolutely unacceptable and I am beyond angry."}, {"date": "6/9/2019", "rating": 5.0, "content": "Best place to have any type of drink. Great service and awesome staff. We usually take our friends and family to try it out. This place is awesome."}, {"date": "6/7/2019", "rating": 5.0, "content": "Best old fashioned in town! Lounge upstairs with small bar. Large bar and many tables downstairs. Great staff that is attentive and super fast with drinks. Water constantly filled and always greeted with a smile. Hostess team out front is top notch. Parking is tough but well worth the work to find a spot. Clean bathrooms and more speciality drinks than one could imagine. This is a must visit."}, {"date": "6/7/2019", "rating": 5.0, "content": "My boyfriend & I went here for drinks after our Anniversary dinner & absolutely loved it! The bartenders were knowledgeable, talented, friendly, & all of our drinks were incredible (especially the Espresso Martini). The atmosphere was lovely as well!"}, {"date": "6/1/2019", "rating": 5.0, "content": "Omg. Happy hour!! 4-7pm is a steal!! A list of maybe 7 cocktails are on offer here mom- fri and the place is lovely and you know what.. cool! We were melting after exploring all day and we started our cocktail happy hour crawl from here!Very knowledgeable bar man and interesting cocktail menu that categorises their cocktails by era!Go here!"}]}}, {"The Lost Lei": {"name": "The Lost Lei", "price": null, "ratings": {"2019": [5.0, 5.0, 4.0]}, "hours": [{"Mon": "4:00 pm - 2:00 am"}, {"Tue": "4:00 pm - 2:00 am"}, {"Wed": "4:00 pm - 2:00 am"}, {"Thu": "4:00 pm - 2:00 am"}, {"Fri": "4:00 pm - 2:00 am"}, {"Sat": "2:00 pm - 2:00 am"}, {"Sun": "2:00 pm - 2:00 am"}], "info": {"Happy Hour Specials": "Yes", "Takes Reservations": "Yes", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No", "Accepts Google Pay": "No", "Accepts Cryptocurrency": "No", "Parking": "Valet", "Bike Parking": "Yes", "Wheelchair Accessible": "Yes", "Attire": "Casual", "Alcohol": "Full Bar", "Good For Happy Hour": "Yes", "Coat Check": "No", "Smoking": "No", "Outdoor Seating": "No", "Wi-Fi": "Free", "Has TV": "No", "Dogs Allowed": "No", "By Appointment Only": "No", "Gender Neutral Restrooms": "Yes"}, "reviews": [{"date": "8/13/2019", "rating": 5.0, "content": "At last a tiki bar that serves strong Polynesian style cocktails. Lost Lei checked all the boxes for me. It is dark, cool, has great service, and  strong, slap yo mama in da butt cocktails.  Is it campy yes...check out the plastic skulls adorning the pillars. Are the drinks sugary, yes, but in Rome. Have I had better, yes, but not in Austin. At the recommendation of our \"reasoning for partying gal\" we gave this place a shot. We all had their Zombie drink and yes the one drink per person limit is more than reasonable. The bartender was free pouring pretty heavy and I said here comes a tiki-style Long Island ice tea cocktail.Well, or drinks arrived in tall tiki glasses garnished with spearmint. Most likely used to cover up the alcohol fumes. I'm sure it was just a coincidence but as we slowly drained our cocktails our conversation became a tad more animated. I'm pretty sure I do not want our photo booth pics posted on the Web. To summarize a cool spot to have a highly/heavily spirited cocktail with your buds. I would highly recommend a one-and-done if you are ordering the Zombie."}, {"date": "8/12/2019", "rating": 5.0, "content": "Cute hidden spot. The whole place is Hawaiian - tiki themed. Cool spot. Didn't wait to get in the second time. The first time we went around 9 \"they were at capacity\""}, {"date": "8/11/2019", "rating": 5.0, "content": "I came across The Lost Lei randomly about a week ago on Yelp and bookmarked it for a future trip downtown. The Lost Lei is located near the Capital Grille on 4th street with a few different entrances. Our party came off of 4th street and walked down the stairs to get inside. My friend, who joined us later, apparently came inside via another entrance. Inside is dimly lite and has skull decorations on the 2-3 pillars. We sat down at a table near the bar, and we grabbed a few drink menus. Everyone decided on the ZOMBIE drink. What is this drink you ask? This drink is about five shots of deliciousness and gets the job done. Not bad for $16. If you want something more mellow maybe try the Pain Killer?Overall a cool chill spot to grab a few drinks. They have a photo booth that allows you to take a few photos with friends, and you can email it to yourself to post on Instagram, Facebook, or twitter."}, {"date": "8/10/2019", "rating": 5.0, "content": "Happened to walk by this gem as we were headed to another destination and a treasure!  Great service, drinks, and establishment!"}, {"date": "8/10/2019", "rating": 5.0, "content": "I love a good Tiki bar. So during my recent Austin visit, when I passed by the sign for this place near my hotel I had to stop in. They have all the classic mainstay Tiki drinks (Mai Tai, Zombie, Fog Cutter, etc) with great garnishing, and they don't skimp on the potency  Also a full bar for any other concoction you may want. They have a sweet Happy Hour too! Bartenders & the owner are super friendly and will walk you through the drinks as needed. Definitely a must if you like a good, fun drink spot!"}, {"date": "8/10/2019", "rating": 3.0, "content": "This was a fun little tiki bar my friends and I stumbled upon during our visit to Austin. The entrance is at the bottom of a stairwell that starts up on the ground level.We went on a Sunday afternoon, and upon our arrival we were greeted by the staff, who were friendly and really knew their menu. The one thing that struck me potentially as a red flag was that the place was empty. However, this place had just recently opened when we went, so, I kept an open mind. We had two drinks there, and in that span of time, the place picked up a little, maybe 10-15 more people came for sunday-funday.Their drinks are very sweet, which I expected, and they weren't too strong. They were a little overpriced in my opinion.I think the place has potential, but it was not one of my highlights of my trip to Austin."}, {"date": "8/6/2019", "rating": 2.0, "content": "The good: drinks are very pretty and good.  The bad: this is not a tiki bar, which is sad.  Some skulls, thatch, and drinks in cool glasses do not a tiki bar make.  The owners need to do some research and go all out if they want tiki respect.  Look at Trader Vics old pictures, Tonga Room, Tonga Hut, Mai Kai, etc.  And the decor and music are all off.  I happen to love 70s yacht rock but it's not the vibe for a tiki bar.  There are so many good choices you could play to set yourself apart - hawaiian lounge, kitshy california surf, lounge in general.  And is it a requirement that all the bartenders be big dudes with hipster beards?  All in all this is nothing special and definitely not a tiki bar.  It's just an average downtown bar.  Could improve though, if you go all tiki."}, {"date": "8/5/2019", "rating": 1.0, "content": "Trader Vic and Don the Beachcomber would be rolling over in their graves..... This is NOT a real tiki bar. Let me repeat that, this is NOT a real tiki bar. If you are a true tiki connoisseur this is not the place for you. This is a 6th street street bar. A funky, trendy 6th street bar. For a regular 6th street bar I'd give this a different rating but for advertising themselves as a tiki bar you get zero stars. Not even close. Nope. Nope. Nope.When I think of \"tiki\" I think of an \"experience\" and an atmosphere that is relaxing and soothing, if that's what you are looking for as well then you need to go elsewhere. Here you will be greeted by music so loud that our group couldn't talk talk to each other without screaming but we did get to enjoy the 6th street dance club loud level of music. No problem, I'm here for the drinks we can talk another time or I can text them. Although we were advised to get a reservation we just showed up and sat at a back table.Where do I begin with the drinks? I tried over four of them to make sure I didn't judge this place on one (possibly) incorrectly made drink. They were definitely consistent with all four drinks.They were all terrible.Polynesian Retreat: what in the actual f*** was this drink? Kool aid in a glass. Super sweet and sugary. The sweetness overwhelmed the drink. Mai Tai: I don't know why we ordered this one, it's so hard to make and everyone has their own version. It looked like a real mai tai but didn't taste like one. I only took one sip because I was ready to leave by this point. Nothing about it tasted tiki but maybe had they sold it was as a non tiki drink it could be salvaged.Fog Cutter: Sadness in a glass. One of the few drinks that didn't put me into sugar shock. Tasted completely off. Did they put vodka in this? Who knows. I was just happy I didn't go into a sugar coma. I got hints of lemon, orange, and vodka...? Wasn't very rum forward. Their take on it, I suppose. It did have gin in it as well. Washed Ashore: No comment. You get the point.I used to hate tiki drinks. Why? Because I only knew those tacky 80's versions where everything had that diabetic inducing sweetness with no depth in flavor. All that turned around a few years ago for me when I finally went to some real tiki bars - Three Dots and a Dash, Tiki Ti, Lost Lake, Latitude 29, False Idol, Tonga Hut, Mother of Pearl, etc - you get the point.  I appreciate real tiki bars and how they are all so different and specialize in their own \"thing\". With that being said, this is not a tiki place even though the drinks sound like tiki drinks. It made me sad that I drove all the way from San Antonio to check this bar out. I'd been looking forward to coming here and finding a real tiki bar close to me but, alas, it was not to be. I should have known better when I was saw dekuyper on their shelves but I wanted to give them a chance. The only fresh juice I saw was lemon and lime juice. Even the process of watching them make the drinks had me wincing - sometimes measuring and other times just free pouring gone wild. Awful tiki drinks. Awful flavors. I wanted to cry at how badly these cocktails were butchered. They are not worth the $12-14 price tag but perhaps for the happy hour prices it's doable (while closing your eyes and ignoring the \"tiki\" part of the drink and just enjoying them as sweet cocktails then it wouldn't be so bad). I also noticed that a lot of the tiki mugs looked eerily similar to Three Dots and a Dash. I mean if you're making that type of investment for a tiki bar please put more energy into making real tiki drinks. With that being said this place is better suited as a 6th street club-ish bar. They have a cute photo taking station on the wall that a lot of the young patrons enjoyed using. They definitely love Deep Eddy Vodka I saw it being poured in a lot of the drinks so maybe that's really their niche. Looks like I'll still be waiting for Austin to get a real tiki bar..."}, {"date": "8/3/2019", "rating": 2.0, "content": "Happy hour specials weren't bad, but unless the the bartender, is trying to hit on your girlfriend, you are treated like a ghost."}, {"date": "7/28/2019", "rating": 5.0, "content": "I was in Austin for 6 nights and spent 4 nights at this bar.  One of the coolest, most chill bars in Austin.  I had a couple different drinks, but my favorite by far was The Zombie.  This thing is worth the price of admission.  10/10 would visit this place again next time I am in town."}, {"date": "7/27/2019", "rating": 5.0, "content": "The bar is a place worth checking out. I was only in Austin for 1 night and spent most of my time here. The staff and owners are extremely friendly. Drinks are yummy and strong. The Zombie will knock you on your butt. We will for sure be back!"}, {"date": "7/26/2019", "rating": 5.0, "content": "In Austin for one night and this was the best place we went. Fantastic drinks, staff could not be more friendly. If you stop in one place for a cocktail maki it the Lost Lei!!!"}, {"date": "7/26/2019", "rating": 5.0, "content": "This is a super fun bar with tasty cocktails and a great vibe. We had the Beach Bum and a Washed Ashore and we loved them both! They came in fun glasses with interesting garnishes. It's a relatively new place and the owner told us they have 7 new drink and some punch bowls being added to the menu in 2 weeks. We can't wait to come back!"}, {"date": "7/23/2019", "rating": 5.0, "content": "Great hide-a-way in the heart of downtown! If the cool vibes and tucked away locale doesn't take you away from it all, the drinks will. This is a special place because of the love and attention the owner and staff put into it. Fun place to go with a friend/partner/date or with a group. Everyone is in a good mood here... hakuna matata!"}, {"date": "7/23/2019", "rating": 5.0, "content": "Just what Austin needed, good traditional drinks, good music and a cool atmosphere. Great service the owner is super friendly. Great place to cool off."}, {"date": "7/21/2019", "rating": 5.0, "content": "This is my new favorite bar. The drinks are authentically tropical, even served in fun tiki glasses, and the bar staff is fully clad in Hawaiian shirts, and seem to be loving every second of it. The Assistant GM, Nolan, stopped by to talk to us for a bit and make sure everything was good, and talked to us a little bit about the menu. Definitely a must-see if you're into a tropical aesthetic and awesome fruity cocktails."}, {"date": "7/21/2019", "rating": 5.0, "content": "So amazing! One of the best last word cocktails I've ever had. So excited to bring more friends here!"}, {"date": "7/20/2019", "rating": 5.0, "content": "Austin has a tiki bar!!! It's a great one too! Drinks were tasty, feel of the bar is great and most importantly the staff is amazing! Every drink is exactly what I was looking for in a great tiki drink. I have been to tiki bars all over the country and Austin has a spot for which to be proud."}, {"date": "7/19/2019", "rating": 5.0, "content": "We were visiting from Cincinnati and wanted to try some fun, creative cocktails. We had a one cocktail rule for each bar to make sure we hit a lot of new spots- but loved it here and couldn't resist getting a few. Super fun environment, bartenders, and great drinks! I think I got Washed Ashore and it was amazing. I got a mojito after that, and considering I had the worst mojito of my life on sixth street the night before... this one was so good. My boyfriend isn't much of a sweet/sugary guy, so he got one with bourbon and coconut, but I can't remember the name. Great spot!"}, {"date": "7/8/2019", "rating": 5.0, "content": "A great new Tiki bar in downtown Austin.  Owned and operated by two brothers who are hard working and friendly.  They sling a mean tiki drink and have a fun ambiance.  Pretty chill when I came but looks like it would get busy on the weekends.  Would recommend."}]}}, {"Edge Rooftop + Bar": {"name": "Edge Rooftop + Bar", "price": null, "ratings": {"2018": [5.0, 5.0, 5.0, 5.0], "2019": [5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0]}, "hours": [{"Mon": "5:00 pm - 11:00 pm"}, {"Tue": "5:00 pm - 11:00 pm"}, {"Wed": "5:00 pm - 11:00 pm"}, {"Thu": "5:00 pm - 11:00 pm"}, {"Fri": "7:00 pm - 12:00 am"}, {"Sat": "7:00 pm - 12:00 am"}, {"Sun": "5:00 pm - 11:00 pm"}], "info": {"Happy Hour Specials": "Yes", "Takes Reservations": "Yes", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "Yes", "Accepts Google Pay": "No", "Accepts Cryptocurrency": "No", "Parking": "Valet, Garage, Street", "Bike Parking": "Yes", "Wheelchair Accessible": "Yes", "Ambience": "Classy", "Alcohol": "Full Bar", "Good For Happy Hour": "Yes", "Best Nights": "Fri, Sat", "Coat Check": "No", "Smoking": "No", "Outdoor Seating": "Yes", "Wi-Fi": "Free", "Has TV": "No", "Dogs Allowed": "No", "Has Pool Table": "No", "Open to All": "Yes"}, "reviews": [{"date": "8/5/2019", "rating": 4.0, "content": "This place is awesome! I recommend going at night, the pool and lights looks so cool and they have a great DJ. Drinks are expensive but the vibe is well worth it. They even have corn hole and jenga. The views are rad too. Right in the middle of the city."}, {"date": "7/27/2019", "rating": 5.0, "content": "Came for a boys weekend, rented a cabana; it was amazing. Nice couches but the service was why we stayed and will come back! Chelsea Kelly made the whole experience. Phenomenal service, couldn't have been better."}, {"date": "7/21/2019", "rating": 5.0, "content": "As far as rooftop pools go, this one is on a lower  floor than most but it does not disappoint. Drinks and drink specials are great and the food is phenom. I LOVE the chicken adobo tacos. I like that they have frosé especially in the Texas heat. Employees are super friendly and the JW never disappoints."}, {"date": "7/14/2019", "rating": 5.0, "content": "There is mediocre customer service and then you have Julianna that is the epitome of family service. Julianna treats you like you are a guest in her house and with the utmost attention to detail. She has a telepathic skill in anticipating your every need. The Edge Rooftop and Bar needs to use Julianna as the platinum standard in hospitality services."}, {"date": "7/14/2019", "rating": 5.0, "content": "JW Marriott is hands down best hotel in town - and this bar is amazing. We come down for a few summer weekend getaway trips a year from Dallas and can't get enough of this place. The pool service is outstanding - specifically the lovely Julianna who always remembers us and makes sure we are well taken care of for our entire stay. Be sure to sit in her section if you can - you won't regret it! Unforgettable experience every time"}, {"date": "7/14/2019", "rating": 5.0, "content": "Rooftop pool and bar at the JW is one of my favorite places in Austin. Amazing views, music and vibe. Also, the service is outstanding!For MDW and 4th of July my buddies and I rented a cabana for the pool party. Julianna made sure the food and beverages were flowing. She's the best."}, {"date": "7/14/2019", "rating": 5.0, "content": "The edge rooftop pool is the highlight of our annual visit to Austin, and Julianna always goes above and beyond to make us feel at home. We always try to sit in her section of the pool just to enjoy her company! Love her and love this pool"}, {"date": "7/12/2019", "rating": 5.0, "content": "Great view of the city and capitol building. Breezy pool is open. Nice for couples and groups of friends."}, {"date": "7/8/2019", "rating": 5.0, "content": "My friend and I came to Austin to celebrate the 4th of July and had an amazing experience at Edge with the BEST cabana service from Chelsea! She went above and beyond to ensure we had an amazing day. She is super bubbly and brings the best energy! We couldn't have asked for anyone better to spend our day with. We'll be back for sure!"}, {"date": "7/6/2019", "rating": 5.0, "content": "Juliana is an amazing cocktail server! What a great day at the JW! Her service was spot on..be sure & ask for her!! We'll be back!"}, {"date": "7/6/2019", "rating": 5.0, "content": "SUCH A GREAT SERVICE!!!! So friendly, so helpful and so patient!!! Such a great place to hangout with friends for a birthday or bachelorette/bachelor party!!"}, {"date": "7/4/2019", "rating": 5.0, "content": "Chelsea Kelly is the friendliest most attentive and knowledgeable servicer I have ever met.  She took care of our 8 person group and knew everyone by name before the day was over she was like one of the family.  Could not ask for better.  Kelly has a five star personality and provides five star service.  Marriot is lucky to have her."}, {"date": "5/21/2019", "rating": 5.0, "content": "We were in Austin from Dallas for a Girls Weekend. I reserved a cabana for Saturday. The Edge people were excellent at staying in contact before Saturday as the weather was very questionable. They called the day before to see if we would prefer a cabana on Sunday due to the questionable weather. We decided to stick with Saturday with fingers crossed. Luckily Mother Nature was in a favour!About the cabanas: They are so gorgeous, classy, and comfy. They were just as nice and even nicer than some cabanas in Vegas. Equipped with high end, oversize patio furniture, flat screen tv, speaker system, tables, and curtains (for privacy if needed). They tap in upbeat lounge music in the cabanas but they will provide an auxiliary cord for you to hook your phone up to listen to your own tunes. About the service: Our server was Julianna. And OH. IM. GEE, she was amazing! I owned a hotel poolside bar in Waikiki for four years. As a business owner, I was EXTREMELY picky about my employees. Based on her attitude, her service, her personality, I would have LOVED to have Julianna as an employee as I KNOW she would have been a great asset to my bar and business. Julianna was so very patient with us 13 girls who every time she turned around, we were asking for something or for her to take a photo of us. And of course, she so obligingly did and she even posed us and took the photo shots from different angles. So not only is she a great server but a fabulous photographer as well! Being a previous bar owner, I know an employee can make or break a business. Julianna MADE The Edge! If and when we return, we will be requesting her! My hairdresser and her husband are staying at the hotel this Memorial weekend. I already texted her to request Julianna as her server! :)About the food and drinks: We ordered food but I chose the \"liquid lunch\" so I'm not sure how the food was but visually, it look very appetizing and plentiful. We ordered bottle service so can't really tell you how well the drinks were. However, drunk me decided to buy 25 shots (24 lemon drops and 1 Patron shot). The bartendar and Julianna handled the big order very well and timely btw.Views: Incredible!I HIGHLY HIGHLY recommend The Edge for your poolside destination! I will admit, it was between them or The W Hotel's pool. The W is \"Guest ONLY\" on Saturdays meaning EVERY person at the pool must be a hotel guest. JW Marriott did not have this rule so THEY made the money off of 13 people with only two of us being hotel guests. And based on the photos of The W's pool, deck, and cabanas.....JW Marriott's The Edge BLOWS them away! One last note/tip: Try to get a room with a pool view if you stay here. The pool has the shape of Texas in the middle which makes a great photo opp! *See attached*"}, {"date": "5/19/2019", "rating": 5.0, "content": "Juliana was awesome in our cabana!! Excellent service, friendly, and helpfulFood was greatClean area that was really pretty"}, {"date": "5/18/2019", "rating": 4.0, "content": "Fun, relaxing happy hour with amazing cocktails to choose from including strawberry lemonade. Our tacos were delicious and the ahi tuna was amazing. Loved the view!"}, {"date": "5/15/2019", "rating": 5.0, "content": "I thoroughly enjoyed my experience at Edge, I arrived with a few friends and was quickly greeted and sat by a really nice server named Julianna.  Her friendliness and quick service made our experience particularly enjoyable.  Beyond the great service, the food and drinks are on point.  Can't wait to go back!"}, {"date": "4/22/2019", "rating": 5.0, "content": "Amazing view and amazing pool area! Really nice seating options and yummy prickly pearmargarita! Best rooftop  birthday photo shoot everrrr haha"}, {"date": "9/16/2018", "rating": 5.0, "content": "The Poolside Cabana MADE our staycation.  Thank you Juliana for your impeccable service and attention to every detail.  It was because of you we had such and amazing experience.  We will be back."}, {"date": "9/3/2018", "rating": 5.0, "content": "This is probably the best pool scene you'll find in Austin. The bar service is so knowledgeable but also quick, even when you order from your lounge chair. The food comes out extremely quickly even when they are busy, so i commend them on that. I recommend the adobe chicken tacos 100% over!"}, {"date": "8/19/2018", "rating": 5.0, "content": "Had a great time with my bachelor party this weekend courtesy of Diandra. We rented a cabana with a bachelorette party and had an absolute blast. We even ended up getting some relay races in the pool."}]}}, {"Firehouse Lounge": {"name": "Firehouse Lounge", "price": "$$", "ratings": {"2016": [4.0, 4.5, 4.0, 4.5, 4.5, 4.5, 5.0, 3.5, 4.0, 4.0, 4.0, 4.0], "2017": [4.0, 3.0, 4.0, 4.5, 4.5, 4.5, 4.0, 4.5, 4.5, 4.0, 4.0, 4.0], "2018": [4.0, 4.0, 3.5, 4.0, 4.5, 4.5, 5.0, 4.5, 3.5, 4.0, 4.0, 4.5], "2019": [4.0, 4.0, 4.5, 4.0, 4.5, 4.0, 4.0, 4.0], "2015": [3.5, 3.5, 4.5, 4.0, 4.0, 4.0, 4.5, 4.0, 4.0, 4.5, 4.0, 4.0]}, "hours": [{"Mon": "5:00 pm - 2:00 am"}, {"Tue": "5:00 pm - 2:00 am"}, {"Wed": "5:00 pm - 2:00 am"}, {"Thu": "2:00 pm - 2:00 am"}, {"Fri": "12:00 pm - 2:00 am"}, {"Sat": "12:00 pm - 2:00 am"}, {"Sun": "12:00 pm - 2:00 am"}], "info": {"Happy Hour Specials": "Yes", "Takes Reservations": "No", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No", "Accepts Google Pay": "No", "Parking": "Street", "Bike Parking": "Yes", "Wheelchair Accessible": "Yes", "Good for Groups": "Yes", "Ambience": "Intimate, Classy", "Noise Level": "Average", "Music": "Live", "Good For Dancing": "No", "Alcohol": "Full Bar", "Good For Happy Hour": "Yes", "Best Nights": "Thu, Fri, Sat", "Coat Check": "No", "Smoking": "No", "Outdoor Seating": "No", "Wi-Fi": "No", "Has TV": "Yes", "Dogs Allowed": "No", "By Appointment Only": "No", "Has Pool Table": "No"}, "reviews": [{"date": "8/13/2019", "rating": 3.0, "content": "We went around 11 on the night of Austin pride, so it was absolutely packed. I'm sure if you like that kind of scene, it would be really fun, but we were looking for something a little more relaxed and casual. The entrance hidden behind the bookcase is cute, but it doesn't really feel like a true speakeasy. Someone is sitting outside the hostel checking IDs, and there's an obvious handle on the door, as well as a constant stream of people going in and out. The music was very loud and it was almost too crowded to move.The atmosphere inside looked like it would have been very inviting on a quieter night, with big leather booths along the back wall, and nice older style drinks. However, it was so hectic inside that we waited for about ten minutes before giving up without ordering anything."}, {"date": "8/12/2019", "rating": 3.0, "content": "Ok so this place is a pretty cool grungy speakeasy, I love the bookcase entrance and the drinks are super unique. The ambiance is dark and seedy which I dig, BUT I will say the drinks were poorly executed and the bartender had to look up he ingredients for every drink she made right in front of me, she may have been new but I could definitely tell she didn't know how to make them as they weren't great and she was kinda gruff. I think if I had a better bartender I would have given this place another star. Hope y'all have a better experience than me but definitely worth at least one visit."}, {"date": "8/10/2019", "rating": 5.0, "content": "Quincy makes the best drinks! Raspberry lemonade and aperol spritz. Great place to spend with your friends!"}, {"date": "8/8/2019", "rating": 2.0, "content": "I'm not sure how their bartenders are unaware of what a french martini is. The condescending tone that was used to tell me that a french martini wasn't actually a martini was not at all appreciated."}, {"date": "7/31/2019", "rating": 5.0, "content": "Great vibe and a hidden gem behind a bookcase in a hostel. Great drinks and love the atmosphere! A must stop when in Austin."}, {"date": "7/21/2019", "rating": 5.0, "content": "What an AWESOME Place just off 6th street.  Firehouse was recommended to me on a recent Austin visit.  It's a great speakeasy bar having to enter through a fake bookcase which is awesome.  Once inside, you feel like family.  Both Bradley and Paul took great care of my party.  The drinks were exceptional.  So glad to have found this place and cannot wait to return on my next Austin visit."}, {"date": "7/12/2019", "rating": 5.0, "content": "We had a fantastic time!! The ambiance was awesome and the drinks were delicious! Our bartender, Bradley, was attentive and friendly.When I told him what I liked he made a drink for me from off the menu-nailed it!! Pony down was delicious 'n"}, {"date": "7/11/2019", "rating": 5.0, "content": "Cool vibe, nice people. Great drinks, lovely speakeasy. Would recommend!! I was there twice had an amazing time , bartenders are cool , drinks are great would def go back"}, {"date": "7/1/2019", "rating": 5.0, "content": "Drinks are fantastic.  They are classic cocktails made perfectly.  The bartender created a drink from listening to me that was perfect.  Ambience is hole in the wall meets hipster but I'm sure it is packed on weekends."}, {"date": "6/30/2019", "rating": 4.0, "content": "Speakeasy with a bookshelf for a door inside a hostel.  Cool vibes and a good spot for a few low-key drinks after dinner."}, {"date": "6/11/2019", "rating": 1.0, "content": "The last positive review is a paid for review. Ha its obvious. The owner responds to the homophobic slurs but when I was treated that bad there nothing. Screw this dump and Bradley is an asshole!! Disgusting pig."}, {"date": "6/7/2019", "rating": 4.0, "content": "Like most Austin locals, I avoid sixth street bars like the plague.  But when out of town friends visit insistent on dirty 6th, we convince them to do a \"walk through\" of the street before venturing away from the chaos into our favorite little nook - Firehouse Lounge!  Nothing says grungy speakeasy quite like pushing aside a bookcase in the lobby of a hostel.  I'm a fan of their extended happy hour until 8pm and their Moscow mules.  The place tends to get a little crowded on weekends and the line to get drinks can be time consuming so visit on off hours for the best experience."}, {"date": "6/5/2019", "rating": 5.0, "content": "Bradleeeeeeeeeeeeeeeeey.When you plop a seat down at the bar and the bartender remembers you (fondly), you know you've found a good bar. I've felt all kinda welcome on both visits and I like that they focus on the classics (gimlet, Manhattan, daiquiri, Old Fashioned). They do some have original cocktails, too, as well as beer and wine, but it's a classics bar all the way.Happy hour is until 8pm with $2 off all drinks.\"Secret\" entrance through a bookcase via a hostel, plenty of seating, and dark lighting make this a great spot to take visitors but also to become a regular.No table service; order everything at the bar."}, {"date": "6/3/2019", "rating": 1.0, "content": "It takes a lot for me to write a negative review.  In fact it took me 3 days of contemplating.  On Saturday night my boy friend and I brought my cousin, her boy friend and uncle (from out of town) to the firehouse lounge.  My cousin specially picked this lounge as she found it was the 2nd best bar in the sixth street area online.  We stood and waiting in front of two empty bar stools for Service.  There were about 2-3 bar tenders working Saturday night when we were there.  These bar tenders completely ignored us as we were waiting 10 mins for service - as they stood around avoiding eye contact at times.  We ultimately decided to leave, not spending a dime here.  As a local Austin native, I was horribly embarrassed by the lack of service we received - especially with out of town guests.  This experience left an awful taste in my mouth - one that keeps reoccurring each time I think about this experience. This isn't the Austin I knew and grew up in.  I have been to the fire house lounge before to enjoy a few live bands.  I don't think I will be back."}, {"date": "5/22/2019", "rating": 5.0, "content": "If you love a good dive bar and are looking for a unique experience, you have found the right place! Firehouse Lounge is a great place to meet people from all over the world because above the bar is an actual hostel. Plus who doesn't love a hidden entrance! Walk in and slide the bookcase and that is where you will find the bar. Good vibes, good service, good peeps!!"}, {"date": "5/22/2019", "rating": 5.0, "content": "Y'all know I love a good speakeasy! So of course when I was in Austin I had to check this place out. I really loved that this one was hidden in a hostel, behind a book shelf. That was all new for me. I can't recall the name of the first drink I had but I remember the prices being very reasonable! A lot of the time you go to these \"exclusive, hiding, or speakeasy\" type bars and they want to put crazy prices on their drinks because of it. There were to young men behind they are, they were super friendly, really speedy, knowledgeable, and fun to talk to. We ended up squeezing 2 high top tables together and our group of 9 girls really had a great time here! We took a group picture on the stage and no one made a fuss about it. So glad this is the bar we decided to end our trip on. It really made our experience fun and different!"}, {"date": "5/20/2019", "rating": 5.0, "content": "This is a fancy yet cozy spot! I bought a round of lemon drop shots which were affordable. When you are outside, it feels like you are at a house party around a fire!"}, {"date": "5/13/2019", "rating": 5.0, "content": "This bar is great. I didn't know what to expect but I love the prohibition style theme of this place. Move the bookcase to enter this venue. It had such a retro feel that is so fun. I love the drinks menu and and the interior aesthetic! There is also a small stage for live music too! Such a fun spot!!"}, {"date": "4/18/2019", "rating": 5.0, "content": "Love this hidden gem (pun intended). Great cocktails and always friendly staff!"}, {"date": "4/13/2019", "rating": 1.0, "content": "Wow - this place had a great place in my heart until today. My girlfriend fell trying to get a glass of water, which was inexplicably on a stairway. She didn't see it and took a tumble. Our fault, no big deal, so I went to the bar to get a glass of water. I stood in line patiently for 10 minutes. The drinks here take a long time to make, I get that. Then I was at the bar and noticed the barback wasn't busy and I tried to get his attention - obviously anyone can get me a glass of water. What was the response? The bar tender told me not to talk to him. Then he says \"do you want his number or something? Hey what's your number this guy wants your number?\" He also added some homophobic slurs that I won't repeat. What???? That's the most insane response ever. Tossing aside how homophobic that is, how is that the response there? That's the most absurd thing anyone has ever said to me. I told them they're out of water and that's what I was asking for. Begrudgingly the bar back gets me a glass of iceless water. Not the hardest thing in the world, but he decided I needed to be slurred in the process. The guy who decided to say I needed to get someone's number instead of a glass of water was wearing a red hat, grey shirt, beard, and it said damn on it. He didn't give me his name but if I get a picture I will update. Stay away especially if you're part of the lgbtq community."}]}}, {"HandleBar": {"name": "HandleBar", "price": "$$", "ratings": {"2016": [4.0, 4.0, 4.0, 4.5, 4.5, 4.5, 4.0, 4.0, 4.5, 4.5, 4.5, 4.5], "2017": [4.0, 4.0, 4.0, 4.5, 4.5, 5.0, 5.0, 5.0, 4.5, 4.5, 4.5, 4.5], "2018": [4.5, 4.5, 3.5, 3.5, 3.5, 4.0, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5], "2019": [4.5, 4.5, 4.0, 4.0, 4.0, 4.0, 4.5, 4.5], "2015": [4.0, 4.0, 4.0, 3.5, 3.5, 4.5, 4.5, 4.0, 4.0, 3.5, 4.0, 4.0]}, "hours": [{"Mon": "3:00 pm - 2:00 am"}, {"Tue": "3:00 pm - 2:00 am"}, {"Wed": "3:00 pm - 2:00 am"}, {"Thu": "3:00 pm - 2:00 am"}, {"Fri": "3:00 pm - 2:00 am"}, {"Sat": "12:00 pm - 2:00 am"}, {"Sun": "12:00 pm - 2:00 am"}], "info": {"Happy Hour Specials": "Yes", "Takes Reservations": "No", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No", "Accepts Google Pay": "No", "Accepts Cryptocurrency": "No", "Parking": "Street", "Bike Parking": "Yes", "Wheelchair Accessible": "Yes", "Good for Groups": "Yes", "Ambience": "Hipster, Casual, Classy", "Noise Level": "Loud", "Music": "Live", "Good For Dancing": "No", "Alcohol": "Full Bar", "Best Nights": "Fri, Sat, Sun", "Outdoor Seating": "Yes", "Wi-Fi": "Free", "Has TV": "Yes", "By Appointment Only": "No", "Has Pool Table": "No"}, "reviews": [{"date": "8/11/2019", "rating": 5.0, "content": "Super fun vibe and good drinks! However, we received very different service from each of the bartenders. One in particular, had a dark brown/black beard, tattoos and wore a hat, offered such rude service. Acted like he had better things to be doing and had no time for us. It definitely put a bad taste in our mouth... but don't want the rating to effect the rest of the great staff"}, {"date": "8/10/2019", "rating": 5.0, "content": "Love the patio for this bar. Seriously it changes the tone of the place and makes it feel more vacationy to me. The bartender was so cool and music awesome. Thanks."}, {"date": "7/22/2019", "rating": 5.0, "content": "Best bar in Austin. Period. Rooftop deck is the place to be. You can teeter totter your way to happiness. A nice escape from dirty 6th. The staff is super fun and wacky. Misting fans to help you cool off. Great jams."}, {"date": "7/8/2019", "rating": 4.0, "content": "Great place to have some drinks. The rooftop is very nice. They have Jenga and a gigantic see saw. The staff is friendly and laid back. I would recommend as a place to go if looking for a chill night out off of 6th street."}, {"date": "6/23/2019", "rating": 5.0, "content": "I think I found my favorite bar in austin! It's super cute. A more intimate ground floor with full bar, basketball arcade, and friendly bartenders, and a cute rooftop bar area with see saw, Futurama playing on a projector, giant Jenga, and horse rides. My gosh it's like a fun, yet chill vibe. I was sold at the free mustaches part! There's even cool art on the walls. Loved everything about it. I highly recommend this place!"}, {"date": "6/22/2019", "rating": 4.0, "content": "I liked this place! We went upstairs to the outdoor patio area, and it just has great vibes! There is a large metal see-saw, which was fun to play on for a couple minutes. It was pretty crowded and busy, but the bar tenders are quite attentive and work quickly! So we had our drinks in no time! This was our 2nd stop on our bar hopping adventure near 6th Street, and it was a good choice."}, {"date": "6/15/2019", "rating": 4.0, "content": "This place seems to have a few different vibes going depending on where you are. Right when you walk in, it's dark and seems more like a dive bar. Then, if you go upstairs, there's a huge rooftop area that's a tad more upbeat. A few TVs if you want to watch a game but not exactly a \"sports bar\". I enjoyed being on the roof (the view was awesome and it's big) but I'm docking a star because the bartenders were not my cup of tea. They were bros being a little too broey--fine in small doses but consistently found ways to be obnoxious for no reason. Talked to hear themselves talk, not much substance, trying to have this like antagonistic-I'm-too-cool-to-even-be-here persona."}, {"date": "6/9/2019", "rating": 5.0, "content": "Great rooftop bar for downtown views. It shares a block with the massive Frost Bank Tower, which was a cool feature. There are very \"Austin-y\" furnishings at this bar, like vintage lettering, draped christmas lights, and random pictures of nude men on the walls. But I grew up in Austin, so bars like this, feel like home. There's a see-saw here, one that you probably won't get a chance to try cause it's literally always being used by drunk laughing people. Music can be pretty loud but it filters out well since it's open-air. Would recommend this bar if you're gonna stay here all night, but it's kind of isolated, so you probably won't come across this if you're bar-hopping or something. Pretty reasonable cocktail prices, and lots of beer selection. Had some pork tacos here which were delicious. I'd come back here!"}, {"date": "6/2/2019", "rating": 5.0, "content": "One of my besties loves to come here so I come often and it's a fun place. They have coconut Red Bull and a fun rooftop patio with live music. Def a good time."}, {"date": "5/16/2019", "rating": 5.0, "content": "I went out here one night for a bachelorette party and I loved it! I love the throwback music and the hipster vibe. They have a seesaw and some playground equipment some great photo ops! The drinks are also very affordable!"}, {"date": "4/16/2019", "rating": 4.0, "content": "Typical dive bar with an awesome patio. I always love coming here on Sunday for happy hour or even after work during the week. It's great for people watching or meeting up with friends. In side it can get quite loud on the weekends, but outside it's open and less noisy."}, {"date": "4/14/2019", "rating": 3.0, "content": "Enjoyed the location and the bartender downstairs was awesome. Came to the roof and watched the bartender give his \"friends\" beer, but turn away paying customers. Be sure to grab your drink from downstairs before you come up to the roof to enjoy the sunshine if you stop here."}, {"date": "4/8/2019", "rating": 4.0, "content": "Free BBQ on Sundays!  Whoo - hoo!  One of the better BBQs we had in Austin.  Not much of a bar downstairs, you gotta go up to the roof to enjoy the place.  Also right next door to Floppy Disk Repair - (best bar in Austin)"}, {"date": "4/7/2019", "rating": 3.0, "content": "Drinks were ok. Customer service could improve a bit. We came in from out of town and it was Sunday. There were very little customers. It took the bartender like 5 minutes to even look our way and order something. It's was around 7pm slow day but he was just Chillen and talking with his buddies. Bartender with the Bennie hat needs to approach customers more often."}, {"date": "4/5/2019", "rating": 5.0, "content": "Cool vibe. Great drinks. Eclectic crowd. Fun atmosphere to unwind after work or late night fun."}, {"date": "3/23/2019", "rating": 5.0, "content": "We went early and I'm glad we did...this place gets packed! We went upstairs and it's a gem! Vast outdoor, covered space. Great selection of liquors. Bartenders were young, friendly guys who made us feel very welcome. We got to watch March Madness and enjoy drinks. Honestly it's a tad dirty but that's from the high volume. I will return when we're in town!"}, {"date": "3/21/2019", "rating": 5.0, "content": "I got catfished, we'll played John, well played. But you were awesome and thank you for the recommendations! The best"}, {"date": "3/21/2019", "rating": 1.0, "content": "Walked in and was greeted by an asshole bartender. Literally just asked if the rooftop was open and he acted like I was an idiot by glaring at me and rudely responding. Find somewhere else to go, like The Caroline, much better service and environment."}, {"date": "3/8/2019", "rating": 5.0, "content": "Great place, I went the bar and enjoyed live music."}, {"date": "3/3/2019", "rating": 5.0, "content": "Great bartender and tasty free barbecue. This place has it going on for the locals."}]}}, {"Dive Bar and Lounge": {"name": "Dive Bar and Lounge", "price": "$", "ratings": {"2016": [4.5, 4.5, 5.0, 4.5, 4.5, 4.5, 4.5, 4.5, 4.0, 3.5, 3.5, 4.0], "2017": [4.0, 4.5, 4.5, 4.5, 4.5, 4.5, 4.0, 3.5, 3.5, 3.5, 3.5, 3.5], "2018": [4.0, 4.0, 4.0, 4.0, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5], "2019": [4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5], "2015": [4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5]}, "hours": [{"Mon": "2:00 pm - 2:00 am"}, {"Tue": "2:00 pm - 2:00 am"}, {"Wed": "2:00 pm - 2:00 am"}, {"Thu": "2:00 pm - 2:00 am"}, {"Fri": "2:00 pm - 2:00 am"}, {"Sat": "2:00 pm - 2:00 am"}, {"Sun": "2:00 pm - 12:00 am"}], "info": {"Happy Hour Specials": "Yes", "Takes Reservations": "No", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No", "Parking": "Street", "Bike Parking": "Yes", "Good for Groups": "Yes", "Ambience": "Casual, Classy", "Noise Level": "Average", "Good For Dancing": "No", "Alcohol": "Full Bar", "Best Nights": "Tue, Wed, Sat", "Outdoor Seating": "Yes", "Wi-Fi": "Free", "Has TV": "Yes", "Has Pool Table": "No"}, "reviews": [{"date": "6/12/2019", "rating": 5.0, "content": "This bar is a favorite of the people that work in the Clement's building and everyone loves the drinks. I really like the patio and the Dark and Stormy drinks."}, {"date": "5/1/2019", "rating": 5.0, "content": "Love this neighborhood bar. Everyone is so friendly. They have a great patio out back and the patrons  are always chill and easygoing.  Mostly locals, not full of obnoxious bros , like some of the bars in  this area.Bartenders are always attentive and make great cocktails!"}, {"date": "5/1/2019", "rating": 5.0, "content": "It's been my favorite bar in Austin for 7 years. Amazing people, cheap and delicious drinks, always feels like home ."}, {"date": "5/1/2019", "rating": 1.0, "content": "Came in on a Wednesday right before a work happy hour - waited at my table then walked to the bar for service . Bartenders never acknowledged me - mind you it WAS NOT BUSY ... worst service ever - go somewhere else**i was at the bar for 10 mins- unfortunately you missed out on a $500+ tab from a work group happy hour ¯\\_(ツ)_/¯ **"}, {"date": "4/12/2019\n            \n\n\n\n\n\nUpdated review", "rating": 5.0, "content": "Dive Bar is back on my 5 star list. I just had to give them a little sh*t for all the Karbach. I went back a week later and the great beer selection they usually have was back. Great drinks and vibe. Check 'em out."}, {"date": "3/28/2019", "rating": 3.0, "content": "Was ok, the only reason we went here was because it was right by our hotel, ordered a screwdriver and it was barely drinkable, low grade vodka. But it IS a dive bar, very small, went on a Tuesday so it wasn't super busy. Went down the street to Texas Chili Parlor and the drinks were waaay better but also more expensive. This place was cheap, $6 for a beer and drink and Diet Coke."}, {"date": "3/9/2019", "rating": 5.0, "content": "Came here with a friend after a night of very hit-or-miss experiences on both ends of 6th St. We were about to call it a night when she decided that we needed to end the festivities on a good note, so I quickly suggested Dive Bar. I've been here in the past, and the staff has always taken good care of me, so it seemed like a good idea.And as it turned out, I was on the money. They were offering $3 wells, and we were sold. It doesn't take much to make us happy, especially when alcohol is involved. The atmosphere was chill and not at all frenzied and hectic like W. 6th, where we'd witness a distraught young woman sit on the ground and start crying about getting kicked out of Greenlight (how do you get kicked out of a place that busy & crowded?!). It was nearly last call, but there were still enough people around for the watching, and the wells drinks were doing their of killing the pain. Life at Dive Bar was good. If I had any complaint, it would be that the pub mix lacked flavor, but when you're getting hammered for cheap, you really don't care about things like that. Highly recommend for anyone looking to get away from the madness of the entertainment district.And I have to give them a round of applause for having the cleanest restroom of any bar in Austin. I've long since resigned myself to stepping in God-knows-what as I take a commercial break while out on the town, but I was very pleasantly surprised to see how clean and well-maintained the ladies room was last night. Five stars for that alone!"}, {"date": "7/22/2018", "rating": 5.0, "content": "Exceptionally well crafted cocktails, with a very knowledgeable staff. If you want a good drink that goes beyond two ingredients then look no further. You can enjoy your time here without becoming poor too as the drinks are reasonably priced."}, {"date": "7/13/2018", "rating": 5.0, "content": "Awesome. My Gf and I walked up to this little gem and were pleasantly surprised. Great drinks ! The bartender was actually a mixologist!  :P haha"}, {"date": "7/7/2018", "rating": 5.0, "content": "My husband and I made this our first stop after arriving in Austin for a vacation weekend. It was awesome. Yes it's dark but it's also cozy and not too loud, even if it's packed. Food is limited to snacks (at least the night we went), but it's good. We got the peanut butter pretzels and they were perfect to hold us over until we went to eat later. One of pur bartenders, Vern (I apologize if I spelled that incorrectly), was amazing. We told her it was our first night in town and she made a list of the best places to visit while in town, even rating them in terms of how expensive they are. She recommended places that are cheaper that locals go to, rather than the expensive touristy places. She was awesome and incredibly hospitable and helpful. Nonetheless, it is definitely a place to visit if you're in town."}, {"date": "6/29/2018", "rating": 5.0, "content": "Awesome, genuine, and exceptional bartenders who feel like friends more than anything else. Although it can get slammed on random nights and at random times, and can feel too packed for a dive bar, I just take that as a sign that everyone loves it there. Who could blame them."}, {"date": "6/14/2018", "rating": 5.0, "content": "Fine establishment. John might be the most congenial bartender I've ever encountered.Three words I'd use to describe this establishment...attentive...timely...tenacious.  A bulldog like tenacity for patron success."}, {"date": "5/3/2018", "rating": 5.0, "content": "We somehow got lucky enough to move two blocks away from Dive. The bartenders are friendly, service is great, and there's a great happy hour with a great beer selection. Being a lesbian couple, we're picky about straight bars - but we have always felt right at home at Dive. They even let us put RuPaul's Drag Race on one night like it was no big deal at all. We love this bar and will keep coming any day of the week!"}, {"date": "4/28/2018", "rating": 1.0, "content": "Very homophobic, xenophobic, and would not let me leave the bar until I literally left the whole areaa. Dive bar was a terrible experience and I do not wish for any other decent person to visit this establishment. They were fine with me until I ordered a drink for my gay friend, which is when they not only refused to serve us,but also threatened to call the police on us... For getting drinks?!!  The servers were very rude, got into our faces and kept making threats about calling the cops even though we were perfectly sober and capable of taking care of ourselves. I'm very disappointed with the way that the servers treated my friends. Would give them negative stars if I could."}, {"date": "4/24/2018", "rating": 4.0, "content": "Great bartender gave terrific service (I asked for a few shots of Bloody Mary mix in my pint glass to go with my beer, and it was done happily).Surprisingly, the atmosphere was more upscale, contradicting the expectations of a \"Dive Bar.\" Smoking was allowed in the back patio, and there was a Handmade Cocktail Menu. I bar snacks had been free, it would have been a 5 star experience. Nickel and Dime-ing is a pet peeve."}, {"date": "4/18/2018", "rating": 5.0, "content": "This is a super laid back bar. I really liked the chill atmosphere. It's thw perfect place to enjoy a good drink and good company John is the absolute best! This bar makes you feel like a regular even if it's your first time. I can't recommend it enough."}, {"date": "1/16/2018\n            \n\n\n\n\n\nUpdated review", "rating": 4.0, "content": "Had to update my review. I still love the dive bar but I'm really sad that Jim is no longer there... it's a totally different feel. Still cool bartenders just not the same. Also, wtf is with that cheap hand soap. Y'all need to bring back the good hand soap!!!!!!!"}, {"date": "1/13/2018", "rating": 5.0, "content": "I love this bar.... I have been here three times so far and will not go any where else.... wonderful ambience, great selection of local beers and good cocktails... John (bartender) is very friendly and accommodating... well deserved five stars"}, {"date": "1/8/2018", "rating": 5.0, "content": "Leah is the very best. Super local easy laid back spot. Collin is a true craftsman. Never miss this spot! Great place to hang with friends and make new ones."}, {"date": "12/12/2017", "rating": 4.0, "content": "I have only been to Dive Bar when I happen to be in that area on foot - for some reason there just aren't many bars in this area so this is the best choice! The space is a really good size (small-ish) and it's not really super divey, but at least it has some dive prices! I went on a night you could get $2 tallboys. Score. The bartenders were all really cool and they were playing Drunk History on the TV. I'd come back if I was needing a drink around there!"}]}}, {"Whisler’s": {"name": "Whisler’s", "price": "$$", "ratings": {"2016": [4.5, 4.5, 4.0, 4.0, 4.5, 4.0, 4.5, 4.5, 4.0, 4.5, 4.5, 4.0], "2017": [4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.5, 4.5, 4.0, 4.0, 4.0, 4.0], "2018": [4.0, 4.0, 4.5, 4.0, 4.0, 4.5, 4.5, 4.5, 4.0, 4.0, 4.5, 4.5], "2019": [4.0, 4.0, 4.5, 4.5, 4.0, 4.0, 3.5, 4.0], "2015": [4.5, 4.0, 4.0, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.0, 4.0, 4.0]}, "hours": [{"Mon": "4:00 pm - 2:00 am"}, {"Tue": "4:00 pm - 2:00 am"}, {"Wed": "4:00 pm - 2:00 am"}, {"Thu": "4:00 pm - 2:00 am"}, {"Fri": "4:00 pm - 2:00 am"}, {"Sat": "12:00 pm - 2:00 am"}, {"Sun": "12:00 pm - 2:00 am"}], "info": {"Happy Hour Specials": "Yes", "Takes Reservations": "No", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No", "Accepts Google Pay": "No", "Parking": "Street, Private Lot", "Bike Parking": "Yes", "Good for Groups": "Yes", "Ambience": "Hipster, Trendy, Classy", "Noise Level": "Average", "Music": "Live", "Good For Dancing": "No", "Alcohol": "Full Bar", "Good For Happy Hour": "Yes", "Best Nights": "Thu, Fri, Sat", "Coat Check": "No", "Outdoor Seating": "Yes", "Wi-Fi": "No", "Has TV": "No", "Dogs Allowed": "Yes", "By Appointment Only": "No", "Has Pool Table": "No"}, "reviews": [{"date": "8/14/2019", "rating": 5.0, "content": "My favorite bar on the east side and maybe all of Austin. The cocktails are as good as it gets and the indoor seating area is small but so awesome! We love the dimly lit room and the vibe it puts out. Old times Texas is what it reminds me off. Think Santa Anna and the battle of the Alamo but in Austin. Do yourself a favor and drop in for an old fashioned! You won't regret it. Don't like whiskey? No worries plenty of tequila, vodka, gin, and more. Plenty of craft cocktails to choose from. Also, great food from the food truck. If sitting outside is your thing there's lots of outdoor seating. We just happen to like the dark, romantic vibe inside. Had an issue recently with payment and they were so kind and accommodating in fixing the issue. Top notch...y'all!"}, {"date": "8/4/2019", "rating": 5.0, "content": "I'm not sure if you'll agree with my 5 stars because I'm still going to give cons. But here it goes.This place has really REALLY good drinks. The seating outside is separate enough from everyone that you can have great convos. Photo booth is cool- my fiancé and I have used it a couple of times just because we come so often. On New Years they had a tent, DJ, free toast drink at midnight, and just a fun vibe. Cool mezcal bar upstairs that's open infrequently.Main cons: when there's only one bar open it can take a minute for a drink. Parking can be a little bit of a hassle (but what else is new in Austin).Great vibe. Great drinks. Great place."}, {"date": "8/3/2019", "rating": 5.0, "content": "Great speciality cocktails! And this place has a unique atmosphere with different settings for seating."}, {"date": "7/31/2019", "rating": 5.0, "content": "Drop in for one and stay for a few; this is what happens when you visit Whisler's.A very chill place with some top notch drinks. Happy hour is a great chance to try the best for less.The indoor seating is unique with taxidermy hovering overhead while graffiti is smattered throughout the walls. The outdoor seating is both covered - or not to accommodate even the most selective individuals.I can't say enough about the drinks other than to try them. People around town know this place is tight and if you're from out of town you'll see why.Note: they have an upstairs Mezcal bar which can be easy to miss and a great onsite food truck - get the Fried Chicken! Yum :)Bring friends, unwind, and chill. Whisler's got you!"}, {"date": "7/27/2019", "rating": 4.0, "content": "Went out with friends for a good time at Whisler's. Drinks are good. Food truck on the on the premises was excellent."}, {"date": "7/27/2019", "rating": 3.0, "content": "Visited Whisler's on a hot Sunday afternoon. A cool space, but I was not into the summer cocktail menu.Quality: Tried a few cocktails at Whisler's, the Whisler's Old Fashioned, Through The Mist, El Santo, and Fire And Ice. Whisler's Old Fashioned was served in a glass flask, I believe to let the flavors sink in. It was solid, but as usual with the drink very sweet. Through The Mist was vodka-based with grapefruit and coconut cream. I did not love the combo, but my girlfriend did. The two other drinks I tried were mezcal-based, El Santo had lime and raspberry, while Fire And Ice came with vermouth and peach. Neither really hit the spot. This was definitely a summer inspired menu, but the light drinks and sweetness were not working for me.Quantity: All the drinks we had were alcohol forward and fair pours.Value: $11 to $14 for Speciality Cocktails.Ambiance: Whisler's is located east of Downtown Austin. From the outside it looks like a hole in the wall dive, but it has a very unique feel inside. Antique touches, old paintings, hanging chandelier, and everything unfinished, give it an old, but cool vibe. Expect rusty chairs and tables, and a feeling that everything is dirty, even though nothing is. They also have a patio area, but it was unusable on a hot summer afternoon.Crowd: A small crowd on Sunday afternoon.Service: The bartenders were passing out sample cocktails for guests to try. A great way to hook people in with the right drink.Parking: Limited street parking in the area."}, {"date": "7/25/2019", "rating": 5.0, "content": "Love the decor. Got lucky to catch a guitarist upstairs when we were there, what a treat! I'll definitely be back..cheers!"}, {"date": "7/1/2019", "rating": 2.0, "content": "Not very impressed.1 STAR = very fun atmosphere and ambiance ( decor was killer )1 STAR = location is great! Lost me on the rest.... Coming from a Service background of 20+ years, went to take my bestie for a birthday drink. 2:00 on a Saturday, no one else was in the Bar. Looked around until we found some voices and was told to order there at the bar. Ordered: Mimosa, Madras. $22. The bartender was aloof and I couldn't get over both the size of the drink - Mimosa  3.5 OZ glass - the Madra's 7 oz glass. The \"juice\" for my drink that should be cranberry and oj had absolutely no flavor, so pretty much tasted like water and vodka. I drank a little bit - went back to the bar and stood there for over 5 minutes waiting for someone to see me ( didnt wait longer since I am currently sporting an Airboot for my ankle ) So I grabbed some oranges and made some more juice. Considering that no one else was there I couldn't believe that we couldn't even talk to an employee about fixing the drink. Maybe this is the new way - but customer service goes a long way and we would've gladly stayed for more drinks had they tasted better and had some service."}, {"date": "6/26/2019\n            \n\n\n\n\n\nUpdated review", "rating": 4.0, "content": "If you are in East Austin, you need to check out this place! It is unique, awesome, and makes some great cocktails (they also have a mezcaleria up top if that is your thing)Ambiance/Service: This place definitely gets busy, so its hard for the staff to get to you immediately, but when they do, they are extremely helpful and very good at what they do. The place is really cool. The inside is unreal and brings you to a totally different place. They also bring in a lot of live music and have a huge amount of space outside to relax and hang out.Food/Drinks: The drinks are super good. They are known for their cocktails and that is what I typically order there. They specifically bring in the pure cubed ice for their main drinks like old fashion, and it is well worth getting. They also have beer and wine, but its a lower selection and just not really the place for that. They don't serve any food, but they do have a partner thai food truck outside that you can order from. Definitely worth checking this place out if you are on this side of town! You will definitely be glad you did."}, {"date": "6/26/2019", "rating": 4.0, "content": "Huge place lots of options. Can get very busy on a weekend. Drinks were very expensive here. Old fashion was 14$ each. They had a old school pin ball machine too. Lots of wildlife decorations too."}, {"date": "6/20/2019\n            \n\n\n\n\n\nUpdated review", "rating": 1.0, "content": "So our server that had been helping us all night replied saying that he saw this go down \"out of the corner of his eye\" and apologized via my yelp review. What a terrible server to see this go down and do nothing. That's probably why he took down his reply  He even offered a gift card as an apolgy. No thanks. Keep your gift card."}, {"date": "6/17/2019", "rating": 5.0, "content": "The inside of this place seems different than the outside. The inside is a rustic, classy saloon vibe. There is a lot of outdoor seating but basically large tables and nothing else. I went around 5 on a weekday, so it wasn't crowded at all and I easily found a seat at the bar. The cocktail list looks awesome, and mine was delicious, but I probably wouldn't go outside of happy hour because they are pricey ($12-$15) for not a lot of drink. Old websites say happy hour is $6-7, but everything on the current list is either $8 or $10. Regardless, it is a nice place and I enjoyed my experience, but ya gotta know what you're getting in to."}, {"date": "6/14/2019", "rating": 4.0, "content": "I'm probably the last person in Austin to try Whisler's, but I finally did and yay, I'm a fan! The palomas were great and, of course, the atmosphere is super cool. Very Austin, so take your friends when they come to see you. I'm looking forward to going back soon and trying out more of their specialty cocktails."}, {"date": "6/12/2019", "rating": 5.0, "content": "Amazing cocktails in an incredible venue. If you are looking to hang out with a large group or grabbing a cocktail on a date Whislers is one of the best spots in Austin. Their rotating cocktails are always delicious. Plenty of outdoor seating but the bar does get crowded on weekends. If you're into Mezcal be sure to check out the Mezcal bar upstairs!"}, {"date": "5/31/2019", "rating": 5.0, "content": "This place can get super packed! I came here on a Saturday evening and it was super difficult to find seats. It's mega popular. I liked the Old Fashioned here and enjoyed the open-air atmosphere at Whisler's. Also having Thai Khun right next to it made me enjoy this place more. I was pretty satisfied with my experience here, but keep in mind that if you're bringing a large group on a weekend you might have trouble finding places to sit down."}, {"date": "5/29/2019", "rating": 5.0, "content": "Good environment for a date or to show visitors coming into town. Can get a little loud inside."}, {"date": "5/27/2019", "rating": 5.0, "content": "Great drinks. Simple menu. Perfect volume - music could be heard but you could still talk."}, {"date": "5/18/2019", "rating": 3.0, "content": "I came here when they had the crawfish boil and damn, that crawfish was amazing, one of the best I've had! The bar itself is unique - vintage, yet has an eerie ambiance. You can tell the building is old and has history. The drink I got was good but the service was slow. I feel like they were taking their time to make 1 drink in the time that they could have made 2. There are patio seating outside but I wished they had a cover over the tables as when it is hot and the sun is beaming down, it could be more cooler. Also, no actual parking lot besides street parking around here."}, {"date": "5/17/2019", "rating": 5.0, "content": "The Whisler's just rocks. Great bar mixologist prepare some of the best cocktails that I have had in a long time. The crowds there are a great mix of locals and visitors. A really fun place to sit down with friends and enjoy some excellent drinks. Be sure to check out the mezcal bar upstairs."}, {"date": "5/15/2019", "rating": 3.0, "content": "This is a gorgeous bar and fits in well with the East Austin vibe. It's a great spot for people watching but I didn't like the drinks enough to justify the amount I paid for them. There's a food truck at the location - I don't remember the name - but it was good!"}]}}, {"Wonder Bar": {"name": "Wonder Bar", "price": null, "ratings": {"2019": [4.0, 3.5, 3.5, 4.0]}, "hours": [{"Mon": "3:00 pm - 2:00 am"}, {"Tue": "3:00 pm - 2:00 am"}, {"Wed": "3:00 pm - 2:00 am"}, {"Thu": "3:00 pm - 2:00 am"}, {"Fri": "3:00 pm - 2:00 am"}, {"Sat": "12:00 pm - 2:00 am"}, {"Sun": "12:00 pm - 2:00 am"}], "info": {"Takes Reservations": "Yes", "Accepts Credit Cards": "Yes", "Alcohol": "Full Bar", "Outdoor Seating": "Yes", "Has TV": "Yes", "Has Pool Table": "No"}, "reviews": [{"date": "8/12/2019", "rating": 5.0, "content": "What a cool place to go to with your friends to cool off from the summer heat and take some cool pics. They have a secret room and a secret hidden camera (hope you can find them) make sure you check out the drinks to! Have fun and get ready to have some instagram worth pictures!"}, {"date": "8/4/2019", "rating": 5.0, "content": "A must-go stop if you're in the area. This bar is unique and fun! There's banana swings, Jell-O shots that travel through a tube across the ceiling, & a big wheel you spin for various prizes. Take lots of pics when you go & try to find the \"secret room\" they have within the bar."}, {"date": "8/4/2019", "rating": 4.0, "content": "Super fun place to meet for a boozy Sunday. All the pics were good as the lighting is the bomb like everywhere you go.The Jell-O shot delivery is what dreams are made of. And queso. Sweet ever lovin queso. The door guy was sweet, and the bartenders put up with all of us."}, {"date": "7/27/2019", "rating": 2.0, "content": "This bar is cute for what it is. Yet I don't see it being anything for a regular outing. It is just a cute place for a photo then you move on. Plus a lot of the guys/girls working there are not very friendly. The big ass wheel game they have is so random. I stood by and watched people winning all kind of \"prizes\" but all scoring the same number a lot of the time. So for $11 I think it would be great to have the prize layout displayed near by.Still it could be worse.  ‍"}, {"date": "7/24/2019", "rating": 4.0, "content": "Drinks are good and cute!Great fun vibrant atmosphere super nice staff.Great place to bring the out of towner friends.It's a very Rainey street bar in The Domain."}, {"date": "7/23/2019", "rating": 4.0, "content": "Words of advice: Day drink here! Super fun. Grammable spot! We all do it, so might as well just admit it. The drinks are a bit on the pricey side but they are fun themed. I liked love potion! It comes in a beaker themed glassware. The only reason I'm not giving this place a solid five on the stars is the service is awful. We were two in a bar with many twelve people in it and it took forever to get service. The bartenders were more interested in having a conversation with each other than serving."}, {"date": "7/23/2019", "rating": 4.0, "content": "I wonder what's in a Wonder Bar! Well, wonder no more. My girls and I dropped in to the Wonder Bar while enjoying a night out in The Domain. Our fearless leader Coffee (Yelp name Aminah M.) knew about this place and said that she wanted to check it out. Once we walked in, I knew exactly why she wanted to visit. This place is full of Instagram worthy photo opps from the unicorn to the lip seat to the swings outside. The DJ had the music going and although the dance floor was extremely tiny, we made our way to it after exploring the different parts of the bar. I must say that the DJ surprised me because I did not expect him to play such good tunes. I really think that the name Wonder Bar is for the hidden camera that puts you on blast for peeking at naughty bits on the back wall of the bar. Besides all the photo opps, that seems to be the hit of the Wonder Bar. So now that you've heard a little about the Wonder Bar, your curiosity has probably been piqued and you want to go check it out for yourself. I can't attest to the quality of drinks but they looked awesome. Other than the drinks, you now have nothing else to wonder about as I've given you the breakdown, right?"}, {"date": "7/21/2019", "rating": 1.0, "content": "If I could give this place no stars I would. Come here if you want messed up watered down drinks that you pay $12 for. All the bartenders seemed drunk. Especially ours blonde girl , she couldn't even make our drinks right and took 10 mins to make two drinks (wrong) it wasn't busy at all. She gave us someone else's card and couldn't find ours. Another bartender found it. She was moody bc I told her to find my card. Wouldn't come here at all! I tipped her $2 for our two drinks and she said \"wow fuck you, thanks for the tip\""}, {"date": "7/21/2019", "rating": 5.0, "content": "Best bartenders in town. They were friendly and seem like having fun. Clearly they liked what they were doing. I personally like to deal with happy employees. I will visit them again if I am in domain area."}, {"date": "7/20/2019", "rating": 5.0, "content": "From the get go ..by myself security David escorting me in through miles of crowd again I would have waited. WONDERFUL BAR ..FRKM FIRST BARTENDER TO  VIVIANA TO DJ LIL NOT A SOUL KNEW MISS KITTY JUST JEN ...and DJ lil j so nice ...let's play a little more house less macarena lol..Wonder Bar t H ank you....Jen Miss Kitty Hooks"}, {"date": "7/14/2019", "rating": 4.0, "content": "Drinks in the patron cup tasted nasty!  Mostly like they weren't made correctly. The inside is cute, good IG pictures. This is a pit stop kinda bar."}, {"date": "7/13/2019", "rating": 3.0, "content": "This is a bar where you basically just say you went to and to take pictures. The drinks were overpriced and the bartenders were rude. The place was empty and they just stood there and chatted with each other. Giving it a 3 stars just because of the photo ops"}, {"date": "7/12/2019", "rating": 3.0, "content": "Great for Instagram pictures, kind of a futuristic looking kind of bar. Decently priced drinks and not overly packed (was there at 11pm on a normal Saturday). Spinning the random wheel is $10 but would study the wheel first- not much on there worth anything close to that"}, {"date": "7/7/2019", "rating": 4.0, "content": "I've seen the promised land for people who love a good Boomerang video.I've listened to both camps - Instagram Trap vs. Interactive Heaven. I hear you. But think about the brilliant design here for a moment. Yes, there are a ton of bachelorette parties all trying to snap the same photo op. Yes, it's 80s and 90's music, which may not be your thing. And yes--so many swings. Now think about who go nuts for swings the most. Kids. Are we all just wanting to relive the fun of our childhood? Absolutely. Who doesn't love a walk down memory lane, mixed with some modern fun? Set your expectations correctly and let your inner 90's child flip over the immersive moments. Maybe go during the daytime to comfort your modern adult though."}, {"date": "7/6/2019", "rating": 1.0, "content": "This place is a one trick pony. Once you have been once and taken a couple photos you'll likely never be back. That's really their only schtick. The only sure way to know youre actually getting alcohol for the hefty price is asking for it straight up on the rocks. The girl straight up did not put any gin in my drink and tried to argue she did, when I asked her to make it again she refused, then she wrote herself a tip in over the line I put across it since we had already tipped her in cash. Thankfully my credit card company took care of it. Also this is a place for really sad and out of control girls who have little to no self respect or common sense. So if that's your thing, you'll love it there. I actually saw a girl flash a guy for free drinks. Is the domain the new dirty sixth? I think so... great place to go if you still have struggles adulting and low standards in life."}, {"date": "7/3/2019", "rating": 5.0, "content": "So pretty, so fun! Theres a hidden room, swings on the patio and shoot for shots! Place is neat and fun! Spin the wheel and hope you dont get the water shot like me lol"}, {"date": "6/28/2019", "rating": 5.0, "content": "Kristi and Alex were our bartenders at Wonder Bar tonight! We had a work happy hour and they provided great customer service even though it was busy!!very happy they work there! Would recommend to anyone visiting north Austin to go to wonderbar on rock rose!!! Great new bar here!"}, {"date": "6/25/2019", "rating": 4.0, "content": "I can see why everyone likes to stop in here! It's definitely a spot that offers a lot of photo opportunities. There is a bath tub in a room (hidden room), horse from a carousel and many other photo props.There is a dress code and it is enforced. We stopped in on a Sunday afternoon and this place was packed. They were playing some good music. They even played NKOTB! The bar serves cocktails in cool glasses. A disco ball, Patron bottle, etc. Very creative and I love it! Adds to the character of this bar.There are swings outside and definitely more opportunities for photos with your squad outdoors. They also have a wheel you can spin. I want to say you have to pay to spin. I watched somebody get free water and then the next time he tried again he got nothing! This place is definitely unique and a cool place to hang out at."}, {"date": "6/24/2019", "rating": 5.0, "content": "This place is so cool and I really liked coming here! Everything is super colorful when you walk inside. There are rainbow streamers at the entrance and there is a unicorn you can sit on and take pictures when you walk in. The whole place is filled with fun, quirky, little things. I got willy wonka vibes when I came here. The drinks are all cool and unique and taste good. I got the one in the disco ball and it was really sweet and tasty. This is a fun casual place to go with during the day with your friends!"}, {"date": "6/22/2019", "rating": 1.0, "content": "There's a bartender this evening named Sky. She was extremely impatient and had a horrible attitude. She asked us to pay for our three drinks prior to giving them all to us. When we asked for our third She practically demanded we pay prior to getting our last drink. We had to ask 3 times for the third drink we paid in advance for which I've never heard of. She then told us to wait she will get it I'm a very childish rude like manner and even rolled her eyes as if we were a problem requesting OUR third drink. It was my friends first time here. She said she's never coming back to poor service. I agree !!!"}]}}, {"Skylark Lounge": {"name": "Skylark Lounge", "price": "$", "ratings": {"2016": [5.0, 5.0, 5.0, 4.5, 4.5, 5.0, 5.0, 5.0, 5.0, 4.5, 4.5, 4.5], "2017": [4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 5.0, 5.0, 5.0, 4.5], "2018": [4.5, 5.0, 4.5, 4.5, 4.5, 4.5, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0], "2019": [4.0, 4.0, 4.0, 4.0, 4.0, 4.5, 4.0, 4.5], "2015": [5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0]}, "hours": [{"Mon": "5:00 pm - 12:00 am"}, {"Tue": "5:00 pm - 12:00 am"}, {"Wed": "5:00 pm - 12:00 am"}, {"Thu": "5:00 pm - 12:00 am"}, {"Fri": "5:00 pm - 1:00 am"}, {"Sat": "5:00 pm - 1:00 am"}, {"Sun": "5:00 pm - 12:00 am"}], "info": {"Takes Reservations": "No", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No", "Accepts Google Pay": "No", "Parking": "Private Lot", "Bike Parking": "Yes", "Good for Kids": "No", "Good for Groups": "Yes", "Ambience": "Divey, Casual", "Noise Level": "Average", "Music": "Live", "Good For Dancing": "Yes", "Alcohol": "Full Bar", "Best Nights": "Thu, Fri, Sat", "Outdoor Seating": "Yes", "Wi-Fi": "Free", "Has TV": "Yes", "Has Pool Table": "Yes"}, "reviews": [{"date": "8/13/2019", "rating": 5.0, "content": "The only legitimate Blues, Jazz and Soul club in the city of Austin."}, {"date": "7/20/2019", "rating": 1.0, "content": "Crazy parking attendant got attitude because I parked in an open spot in the front with plenty of space? I was trying to meet some friends here who had arrived about 30 minutes earlier and did not pay a cover nor were told there'd be one soon.  Doorman asked me to pay a cover and wouldn't even let me quickly go explain to my friends what was happening. I guess I just missed the cut off for cover but it was 730pm, and I could see my group. Guy was just on a power trip. First and last time I try this place."}, {"date": "7/10/2019", "rating": 5.0, "content": "So much fun! If you're looking for a place to listen to live blues music, good drinks and fun environment.. this is it! Plus if you get there early enough, you can get a good spot and great food!"}, {"date": "7/7/2019", "rating": 5.0, "content": "\"Now don't be afraid, just go on in. You'll have a great time.\" That was the advice we received from our Uber driver.Calling it a dive might be generous. The ceiling is pieced together from various materials that may or may not be up to code. It's fine; it's so dark you won't notice. Remember, though, 5-stars.And why would I give a dive 5-stars? Jazz, blues, diversity of race and age, and an atmosphere that embodies the friendliness of Austin and highlights the benefit of being in the live music capital of the USA.I don't think they serve food. There is no bar menu. Nobody cares.Get there early if you hope to sit down."}, {"date": "6/23/2019", "rating": 4.0, "content": "It was dark outside.  Couple mobile structures kind of like a trailer park.  The only light was above a red door and an \"open\" sign.  If you look up, you'll see the Skylar Lounge sign.  By the looks of the building, you may want to get in the car and get the heck out of there.  Don't let it scare you.  When you walk in, you'll hear blues or sultry jazz music. The bar is dark and the stage is lite in red in the far back.  It's a small lounge so you may or may not have a place to sit.  The singers are engaging.  Soul man Sam and his band was playing.  His bass player is talented as is Sam.  I was told that Animal House was filmed here but I have not confirmed it.  The people are friendly.  They don't have bar type food anymore.  They do have some soul food but limited.  You go there for the music."}, {"date": "6/11/2019", "rating": 5.0, "content": "This place was amazing! The live music doesn't seem like it can contain itself in the space and it makes for an amazing experience. Bar staff was friendly and attentive and we had an amazing time!"}, {"date": "5/27/2019", "rating": 5.0, "content": "Picture this, two girls out and Austin looking for some live music. Asking around for some good places to go. Getting ready and then calling an Uber. Once in the Uber the driver asks us where we're heading. We tell him that we are looking to listen to some music and the place that we're going to is somewhere that was suggested to us.Imagine our reaction when he just told us, \"that's mainstream.\" Apparently where we are going was too mainstream and he asked us if you wanted to go to a place that had real music. I mean yes? So he changed courses and brought us to the Skylark lounge.Granted we were a little skeptical just in the parking lot because this lounge is it also in the middle of nowhere, and we didn't know where we were. but the Uber driver assured us that this was the place that people go in Austin to hear music, good music.I can't say for sure if he was right for the people of Austin. But I can say for sure that it was the best night that we had in the city. The music was amazing we even ate some of the food and that was delicious, to the point that we ordered another basket, and we danced the night away. It didn't matter who you were you were invited to dance and people included you like you were best friends. This was the best suggestion ever. I wish I could tell the Uber driver he was right on and give him a bigger tip.If you are looking for a place to go in Austin for music check this place out. It's not going to be fancy but it's going to hit the spot."}, {"date": "5/20/2019", "rating": 4.0, "content": "The Skylark Lounge is a definite go-to for great live blues, jazz, and bluegrass music. A great selection of beers and cocktails and the whole divey vibe with a pool table. The outside area is a pleasant surprise and has a TV for your sports fans. Sam's BBQ, for $12, hands down, one of the best BBQ hidden gems I've had in Austin or Kansas City."}, {"date": "5/12/2019", "rating": 4.0, "content": "This is a wonderful spot to grab a drink and listen to some great music. They have a tiny parking lot so get there early, grab your seat, and get ready to be blown away by some great blues, jazz, or whatever they have playing that night.I came in on a weekday and there was no cover, the place was pretty packed. The bartender pour my drinks so strong I had to go back and ask for a top off of soda! That's rare for me because your girl can DRANK! I can't wait to get back and listen to other bands they've got lined up!"}, {"date": "4/27/2019\n            \n\n\n\n\n\nUpdated review", "rating": 5.0, "content": "Best time ever! Every time I come to Skylark Lounge it's a thrill. Two times this week... Great talent, great patrons, great atmosphere. Love you guys, especially Soul Man. He's a talented man. I heard someone called it the house that soul man built. It's true. Saw Brian Scartucci tonight. He's got a great choice"}, {"date": "3/31/2019", "rating": 4.0, "content": "Unpretentious. Fun. Good times.Went on a Friday night for the first show. Had cheap beer with great live music and had a ball. Like the reviews say, it IS small so if you're going for a later show, go early.Also, there's a great guy selling chicken and fish next door so go hungry."}, {"date": "3/1/2019", "rating": 5.0, "content": "What a hidden gem. Great atmosphere and fantastic music. Bartenders were friendly and so were the staff."}, {"date": "2/19/2019", "rating": 5.0, "content": "I've been to The Skylark Lounge on multiple occasions to listen to live music but I've never left a review before so for sure I have to do my Yelp duty & share this helpful info with all my Yelp peeps :)! On our most recent visit to The Skylark Lounge on 2/15/2019 we came to see The Soul Man Sam & The SMS Band..all VERY talented musicians & Soul Man Sam is now 71 years old & let's just say that when I grow up I want to be just like Sam! ;) Since sharing is caring here are a few of my \"likes\", \"FYIs\", and \"Helpful Info\"..Likes:-Atmosphere is 5 stars for sure! I just LOVE the vibe at The Skylark Lounge! It's the perfect combination of darkness & just very Austin-like. Its a very intimate venue to enjoy awesome live music & there is even a small dance floor if you feel like shaking something ;). -Young & old come to enjoy music FYI(s) & Helpful Info:-Parking: There's a small gravel parking lot at The Skylark but it gets filled very fast. This past Sat. they put a sign near the front of the parking lot once parking was full to notify people that there was additional parking next door at a bodyshop but that lot also got filled fast but FYI you can also park on the street, which isn't to far of a walk to the venue. -There was a $7 cash cover charge on the Saturday we went on 2/15/2019 -There is seating inside w/ tables & a few booths & seating at the bar but it can get filled pretty fast so I recommend you get there early to grab your spot. There's also outside seating w/ lots of tables & an outdoor tv & outdoor lights. -There's a pool table :) -There is a full bar & you can also buy food to munch on while you're enjoying the awesome music. The night we were there you could order food from The Peoples Soul Food & the owner of that company came by every table to give you the menu & take your order. The Soul Fries on the menu for $4 were so delicious!! You could also buy bbq from Sams BBQ outside in the back. For sure whenever you're in the mood to check out some awesome & talented musicians make sure to check out The Skylark Lounges website to see who's scheduled to play. For sure I'll be checking out The Skylark Lounge again in the near future. -Rebecca out"}, {"date": "2/14/2019", "rating": 5.0, "content": "The Skylark Lounge is the Austin I've been looking for! Take a seat, I have so much to say.Before moving here recently, I had a perception of Austin, one which I had yet to experience--until now. While the husband and Daughter #4 were off to the Fleetwood Mac concert at Frank Erwin Center, Daughter #2 and I also planned a night of good music, blues or jazz, but where? I didn't want to pay $20 (Note: husband paid shockingly way more than that for their concert tickets.) for a band I'd never heard of. And I didn't want to meander down 6th with the youngins. So Daughter #2 and I put our best research skills to work. We found a bunch of places with live music (duh, it's Austin), looked at online photos to find the right vibe, compared cover charges and listened to clips from featured acts. Skylark Lounge came out on top.Parking is very limited. Somehow we managed a spot right in front (I think because it was tight, few ventured to try it. Thanks, Mom, for teaching me how to parallel park all those years ago!) Frankly, I'm not sure where people park if not in the lot. From the outside, it looked like a long, wooden shack. No...a roadhouse...yes, it looked like the quintessential roadhouse. The cover charge was $7 (higher than the $5 listed online.) Very dark, low ceilings, limited seating. To the left as you walk in, it is long and narrow with three main sections: a bar with some seats on one wall, a row of tables (low and high tables) in the middle and booths along the other wall. Every seat was taken when we arrived and the aisle between the bar and the tables was also jam-packed. The stage is at the far end and next to it is a doorway leading to an outdoor patio. I believe there is a room to the right of the entrance with a pool table. We managed to get our drinks, then I moved to stand in the aisle between the booths and the tables, where there were fewer people. Within 15 minutes, a couple at one of the high tables was leaving, so we were able to grab their seats.Here's something I loved: besides the booths, it seemed that those sitting together at the tables were strangers. I watched as three 20-somethings sat at a table with two 60-somethings and, soon, all were chatting and laughing as if they'd know each other for years. Our seatmates weren't quite as chatty, but nice just the same. Performing when we arrived was Oscar Ornelas. OMG. The guy was FANTASTIC! I simply cannot say enough about Oscar and his band. The talent, the energy. At one point, Oscar was playing the piano with one hand, playing the saxophone with the other hand and singing in between blows. It was simply spectacular.There was a very long intermission as the second act--Birdlegg and the Tight Fit Blues Band--were waiting on a band member. I ventured outside to the patio to find Birdlegg himself. Such a character (and a flirt!) Had a lot of fun hearing his stories and he even wrapped his coat around me when I got chilled. When Birdlegg took the stage, he became the consummate professional. Singing, playing the harmonica, and dancing in a manner that defied his 71 years. He owned the stage and the crowd loved him.We didn't order any food, but my Moscow Mules were quite tasty. The pour became a little weaker as the night went on (sorry, guy, I wasn't too drunk to notice) but it was remedied upon request. Not only would I go back to Skylark Lounge for sure, I cannot wait to go back!"}, {"date": "2/14/2019", "rating": 4.0, "content": "What a fantastic hot spot. Hidden away and off the main road, Skylark is the quintessential Austin music venue you hear about. I brought my mom here on a Saturday for blues/jazz and she was blown away. The live music was fantastic and entertaining. $7 cover for a Saturday night, cash only. There is one main room, with the stage in the back corner. Luckily the music can be heard throughout, however, seating is limited, and standing by the bar does make it challenging to see the band. We were able to snag a seat from a couple leaving after about 15 minutes of arriving. Out back is a garden/patio with a fire pit and seating. Many use for smoking. My mom had an opportunity to meet the extremely charismatic harmonica player who was going on at 10pm. He was extremely warm and friendly. Made watching him perform on stage so much cooler! Such a talented gem who we would definitely return to see. Overall, this is the place you go for a lively, but chill night. Great mixed aged crowd with some scattered regulars. Recommend to get there earlier (before 8:30pm) to snag a seat, although if you come later, seating is possible, but be prepared to potentially stand until someone leaves. Only complaint was that the pour on some Moscow mules was weak. We addressed this with the bartender and he returned to his original pour. Appreciated his willingness to listen and adjust. Despite this, prices are great!"}, {"date": "12/24/2018", "rating": 1.0, "content": "I'm guessing this dive exists mostly on business from regulars because they treated us like lepers. The bar back smelled like dirty ashtray from 10 feet away. The bartenders apathy and disdain for patrons is smoldering. I can't imagine a more unpleasant bar experience.The piano music was cool though. Seriously, the bartenders need to lighten up."}, {"date": "12/18/2018", "rating": 2.0, "content": "I have been wanting to come here, and finally made it tonight. It's a dive of the diviest proportions. Chairs all rickety, dark, smoky, nestled behind some mechanic shop down a dark alley, with music that sounds like you are at a high class fine dining establishment. I kinda dig the juxtaposition of it all! However, I was pretty annoyed with the blonde and bangs girl bartender. She was sooooo lacking in people skills. She really seemed to just hate people. The bf tried to make a joke, and she was super put off, and then was rude to me as well. Silly little millennial. She needs a different job, because she is not suited for bartender. But I digress, I will still pop back in to see some music again and take my chances on the ricketyness off it all."}, {"date": "12/12/2018", "rating": 5.0, "content": "One of the great live music venues and hidden gems in Austin. Skylark is ideal for friend groups and date nights alike. When not watching the outstanding (and oft legendary) performers who frequent the stage, check out the pool table in the room by the entrance or sit by a fire pit on the large open-air patio out back. Drink prices are super reasonable too. The blues HH is awesome for after work gatherings."}, {"date": "12/11/2018", "rating": 4.0, "content": "This was one of the most random nights of my life... and it was awesome! My friends and I dropped in on a Saturday night ($10 cover) to listen to some live music.  We were treated to the rap stylings of Frost (who was later filming a music video in the backyard!) and the jazz/hardcore stylings of 89-year-old​ Lavelle White.  It was all very weird and enjoyable.  There were so many random people in this small bar (elderly, hipsters...) and everyone was having a good time.  I loved the large outdoor area that was filled with lawn ornaments and eclectic seating.  It's everything in a dive bar that you could want.  I definitely recommend stopping in at least once. You never know what you're going to get!"}, {"date": "12/9/2018", "rating": 4.0, "content": "Cool cozy place in the hood!  If you want to  get away from the ATX crazy scene and hang out with cool strangers, cool live music and a keeping it real environment?  This is the place for you and all are welcomed here."}]}}, {"Draught House Pub & Brewery": {"name": "Draught House Pub & Brewery", "price": "$$", "ratings": {"2016": [4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.0, 4.0, 4.0, 4.0, 4.0, 4.5], "2017": [4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 5.0, 5.0], "2018": [5.0, 4.5, 4.5, 4.0, 4.0, 4.0, 4.0, 3.5, 3.5, 3.5, 4.0, 4.0], "2019": [4.5, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0], "2015": [4.0, 4.0, 4.0, 4.5, 4.5, 4.5, 4.5, 4.0, 4.0, 4.5, 4.5, 4.5]}, "hours": [{"Mon": "3:00 pm - 2:00 am"}, {"Tue": "3:00 pm - 2:00 am"}, {"Wed": "3:00 pm - 2:00 am"}, {"Thu": "3:00 pm - 2:00 am"}, {"Fri": "1:00 pm - 2:00 am"}, {"Sat": "1:00 pm - 2:00 am"}, {"Sun": "1:00 pm - 2:00 am"}], "info": {"Takes Reservations": "No", "Take-out": "No", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No", "Parking": "Street, Private Lot", "Bike Parking": "Yes", "Good for Kids": "Yes", "Good for Groups": "Yes", "Ambience": "Casual, Classy", "Noise Level": "Average", "Good For Dancing": "No", "Alcohol": "Beer & Wine Only", "Good For Happy Hour": "Yes", "Best Nights": "Tue, Wed, Fri", "Smoking": "Outdoor Area / Patio Only", "Outdoor Seating": "Yes", "Wi-Fi": "No", "Has TV": "Yes", "Dogs Allowed": "Yes", "Caters": "No", "Has Pool Table": "No"}, "reviews": [{"date": "7/31/2019", "rating": 5.0, "content": "Tuesday night at the Draught House, nothing like it!!!$2 off everything and the available brews change periodically.  This is the time to try new things.  And after a few beers, go outside and try the S'rooms!"}, {"date": "6/22/2019", "rating": 5.0, "content": "This review is for 4.5 stars.This is a beer drinkers brewery.  Seemed like an endless amount of beer on tap (but probably about 60 if I had to guess).  Really hits every variety and they offer tastes even before buying.  I went with a flight to try 5oz of 4 pours.  Good portion but I was charged $1 which is pretty excessive in my mind.  Other than the price, I liked the place and location.  Really a beer forward establishment with no TV, darts, and tons of seating indoor and outdoor.  This is not your new age place - come here to drink and to conversate.  Dogs welcome and parking tough in the lot but plenty along the street.  Overall I enjoyed myself and considering free WIFi I can  forget about the lack of TV.  For beer, this is on the short list in Austin."}, {"date": "6/7/2019", "rating": 4.0, "content": "So many beers on tap - pull up the menu on your phone and order after you've had time to leisurely peruse the list.  The DH beers are $2 off on Sundays and its a nice laid back group of folks.  We didn't notice a lot of business at the food truck - we miss the guy that would grill for tips only - BRING HIM BACK.  Sit outside under the trees and umbrellas and play cards or Jenga - the inside, though air conditioned, smells like....a beer pub.  {mushroomy}  But, hey, the beer is cold and very tasty!"}, {"date": "2/17/2019", "rating": 1.0, "content": "Worst tempered bartenders in town. If they are out of a particular  beer that they actually have in stock to tap they don't give a fuck"}, {"date": "1/30/2019", "rating": 5.0, "content": "Huge selection of beers. Had the house IPA Vulcan. Hoppy and nice finish. To top it off, free brats. Sat outside on a rainy Saturday afternoon - under umbrellas and heaters."}, {"date": "1/17/2019", "rating": 5.0, "content": "If what you are looking for is a vast range of beer choices, then this is the place for you. I can guarantee you there will be something you'll love here as they have dozens and dozens of beers on taps from a wide range of breweries both local and national. If you are into trying different beers, definitely always go for the flights as this is the best way to try more. There are plenty of tables inside and outside and seem like a really nice place to bring all your friends along."}, {"date": "12/11/2018", "rating": 5.0, "content": "A really good brewery with lots of drinks on tap. A fantastic atmosphere and a great place to meet a group of people. I came here for a  corporate Holiday party and we all had a great time with great drinks and beer. With lots on top from IPAs to Ciders and everything in between, you are sure to find something everyone can enjoy!"}, {"date": "11/26/2018", "rating": 5.0, "content": "This is a true pub. Beer, beer, and beer. Eat somewhere else. There is a food truck, but you can do better."}, {"date": "9/2/2018", "rating": 2.0, "content": "As soon as you get to the place it doesn't have much parking space. Everyone outside looks bored and tired. Inside is very dark and cold. I asked the bartender if I order food outside or inside and he said \"yes\" with an aloof expression. I felt unwelcomed. The crowd is older. The beer was great. So I like the beer but I hate the place."}, {"date": "9/1/2018", "rating": 5.0, "content": "Love this place. Seriously impressive collection of beers and knowledgeable bar tenders. Great outdoor seating. Only downside is I'm not a fan of the food trucks they havr in the parking lot, but that's not enough for me to remove a star. Draught House is a must if you like to try different beers in a super laid back setting"}, {"date": "8/14/2018", "rating": 5.0, "content": "Sunday nights they have all their house beer on sale. We tasted almost all their house beers and they were all great. There is a huge digital display over the bar showing the beer color, percentage, type, brewery, how full the keg is, and the price. Pretty cool! Wasn't too busy on a Sunday night."}, {"date": "8/13/2018", "rating": 3.0, "content": "They have exceptional customer service however nothing special about the prices or selection. The outdoor seating was quite nice, weather permitting... Because the indoors are kept very very cold. Definitely take a sweater. Even with all the help I wasn't able to find a drink I enjoyed. Some of the ones of interest they didn't have in stock. Furthermore, I ended up with diarrhea and stomach pains for the one large low IBU IPA I had. Not on my revisit list."}, {"date": "8/10/2018", "rating": 4.0, "content": "German style themed pub with some nice outdoor seating in the front. If you come here on a Saturday afternoon, they have FREE bratwursts that you can help yourself to. Whaaaa??? Of course we had to get one and they were pretty decent too. As far as the beer goes - they have a pretty big menu to choose from, with some local favorites. And if you're in the mood for something else, they also have some wine options, although the wine tastes pretty cheap and you're probably better off just grabbing a beer."}, {"date": "7/7/2018", "rating": 4.0, "content": "This was a cute German bar. I'm not the beer drinker of the group so I always appreciate when a bartender helps me out. I asked for something light and maybe fruity. I was met with an adorably refreshing raspberry beer, it was perfect for summer. Boyfriend had the Guadalupe Texas Honey Ale - he loved it!They have large German style benches out front with yard games. The ambience was very chill and on that particular evening there seemed to be a lot of families with children. So again, very chill. There's also a food truck out front for any snacking you might want to do which I always think is a great idea for late night venues. Overall it was a charming experience, would recommend to try for the beer lover and companions since there are options for everyone."}, {"date": "6/25/2018", "rating": 5.0, "content": "Love to drink here on Tuesdays for pint night, or any other time friends are looking for a place to hang out! Expansive beer selection with lots of local breweries, great community of people, and tons of outdoor seating with shade in the summer and heat lamps in the winter. My only complaint is that 99% of the time I go here, it's on Tuesday and the food truck is always the same (Quality Seafood). Quality Seafood is also great, but I sure wouldn't mind some variety."}, {"date": "5/13/2018", "rating": 4.0, "content": "Great atmosphere if sitting outside...inside classic dark English / Irish pub feel...right down to the strong stale beer smell. Beers in all categories are solid, so combine the outdoor seating on a nice day and beer flights (good, broad selection) then definitely worth coming here"}, {"date": "5/9/2018", "rating": 4.0, "content": "This place is as laid back as they come. With the large, outdoor patio and now - new addition of outdoor seating area in their adjacent parking lot, the Draught House certainly lends itself to an easy, breezy, beer-filled afternoon in the sunshine. But when that Austin heat starts to rear its ugly head, there is a dark and cool interior to which you can retreat. The selection of beers is as varied and eclectic as the clientele here, and are the two main reasons I enjoy this place so much. It's also pup and kiddo friendly. So, win, win for my motley crew when we need a beer at the end of a long week. There is a logistical funk when it comes to ordering a beer. Thank goodness they opened up another outdoor bar in the said new seating area, because the bar inside starts to accrue a bottleneck, and fast. Don't get me wrong, the interior is really cool with ye olde pub feels and a dark wood bar to help you feel as if you're in a true UK pub. However, the line to the bar can only one way, and that - often times - goes out the front door. It does move fast and eventually you get a delightful beer that makes it all worth it!"}, {"date": "4/8/2018", "rating": 1.0, "content": "I have to agree with Mark F's review below -- a beloved Austin tavern has been ruined. Poor management, best staff being let go, the whole thing has just gone to hell. I used to put up with the parking situation, etc, because I loved the Draught House, but those days are over. It's now just awaiting its sad decline to a firesale."}, {"date": "4/7/2018\n            \n\n\n\n\n\nUpdated review", "rating": 2.0, "content": "I'm sorry to say that my half joking, mostly serious last review appears to be coming to fruition.  An Austin institution is disappearing right before our eyes (from our perspective).  When the big screen TV's came in and the funky beer signs came down from the wall, we took that as a clue and our ears/eyes perked up.  Now the big screen tv's and blank white walls exudes that old DH \"feel\" and warmth.Recently we noticed they are now serving \"Coors Banquet\".  Again, this was a comment I made in my last review about \"what next\" Bud and Coors? I hate the fact that the \"big boys\" brewers are slowly slipping in so I suspect that in time there will be lots more taps.    We even chatted it up with a few of the regulars who lamented about the same stuff.  On our last visit we find out that our favorite bartender Sluggo isn't there so now we don't feel like this is DH anymore.  It's difficult to find a bar that you like and it's even more difficult to make that bar your weekly jaunt because several things must be aligned: kick any local breweries that sold out to the big boys to the curb (check; until recently); one 19\" TV on, at most, in a corner and on the news (in case North Korea sends a missile, so we know), No Coors/bud/bud-light/PBR, etc. That attracts a different crowd. Place needs to have character, wall art, or something that makes it stand out from the herd from all the other drinking holes in this town, for some reason the new 'look' is barren.Finally the man (or woman) behind the bar is a special breed of person that knows their $hiT.  We'd walk in and Sluggo told us about new beers and had a taster in mind for something he thought one of us would like (he was usually right).  For many years, many Thursdays, we felt like this was our \"Cheers\" bar.  This is the place we took out of town company to, met friends at, and we grew to love the place as the bar that outlasted all of the novelty bars over the years. We're not sure anymore and don't like the changes creeping in so we're going to take some time off for awhile and see what happens.  It's not like there isn't any other place in Austin that doesn't serve good craft beer, right?  Good luck DH, I hope change is good and you achieve what you're after."}, {"date": "2/25/2018", "rating": 4.0, "content": "great selection of brews. nice place to take my friends when they come to visit"}]}}, {"Violet Crown Social Club": {"name": "Violet Crown Social Club", "price": "$", "ratings": {"2016": [4.0, 3.5, 3.5, 3.5, 3.5, 3.5, 4.0, 4.0, 3.5, 3.5, 3.5, 3.5], "2017": [4.0, 3.5, 3.5, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0, 4.5], "2018": [4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5], "2019": [4.5, 4.5, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0], "2015": [4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.0, 4.5, 4.0, 4.0]}, "hours": [{"Mon": "5:00 pm - 2:00 am"}, {"Tue": "5:00 pm - 2:00 am"}, {"Wed": "5:00 pm - 2:00 am"}, {"Thu": "5:00 pm - 2:00 am"}, {"Fri": "5:00 pm - 2:00 am"}, {"Sat": "5:00 pm - 2:00 am"}, {"Sun": "5:00 pm - 2:00 am"}], "info": {"Takes Reservations": "No", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No", "Parking": "Street, Private Lot", "Bike Parking": "Yes", "Good for Groups": "Yes", "Ambience": "Divey, Casual, Classy", "Noise Level": "Average", "Music": "Juke Box", "Alcohol": "Full Bar", "Good For Happy Hour": "Yes", "Best Nights": "Thu, Fri, Sat", "Outdoor Seating": "Yes", "Wi-Fi": "Free", "Has TV": "Yes", "Has Pool Table": "No"}, "reviews": [{"date": "8/12/2019\n            \n\n\n\n\n\nUpdated review", "rating": 5.0, "content": "Great happy hour and always cheap drinks other wise. Dim lit inside with booths along the walls. There is a patio out back with picnic tables and tables. Just had an Iron Claw and it was delicious. It's a black cherry white claw in a glass of Violet Crowns signature drink Iron Whip. Cluck-n-Burger is the new food truck outside. Great burgers, wings, and shared plates. I would recommend the buffalo burger and crispy red potatos. The meat and cheese charcuterie is delicious too."}, {"date": "7/22/2019", "rating": 4.0, "content": "My roommate tells me I've been to Violet Crown Social Club... before we moved to Austin and we were in town looking at apartments. I don't believe him. I finally went this past weekend since I didn't remember going before and dug the spot. Not as social Shangri La, but on a Friday night they had a sign up for $3 wells and had decent music playing, so it was A-OK with me. I'll have to work this place into my bar rotation."}, {"date": "3/19/2019", "rating": 5.0, "content": "We have been here a couple of times and it is usually our last stop on the Eastside before heading home. We love the vibe here and you can always quickly score a strong pour even when they are busy.During SXSW we figured it would be wall-to-wall and we were pleasantly surprised to find the bar area pretty empty (the patio area was jammed). We scored a nice side booth that was great for people watching.They do have some decent beers available and if you have the munchies there is a food truck on site. Good pours and a good vibe..."}, {"date": "3/2/2019", "rating": 1.0, "content": "Somehow they employed a racist bouncer. I have no idea in Austin how this happens but it is really sad that it did here. This place used to be great, but clearly has gone downhill."}, {"date": "10/1/2018", "rating": 4.0, "content": "TLDR: Cool bar, local beers. The pizza outside thooo.___I came in while I waited for my pizza being made in a little truck outside. I knew I had about 15 minutes so I thought it would be the perfect chance to catch up on social media and drink something local.I got a local hefe ($7). It was really good. Super friendly staff. The bar is cool - kinda divey and just really chill. I took a seat outside in the little patio and the pizza folks will actually bring the pizza in for you - clutch."}, {"date": "7/5/2018", "rating": 5.0, "content": "I always try to stop here when I visit the East side. Pretty cheap drinks and they have had Adelberts Triple B on draft for like $4 when I have visited!! A MUST GET for any beer drinker!I think everyone knows about the infamous 313 pizza!I love this place!"}, {"date": "5/31/2018", "rating": 4.0, "content": "Great bar but man they really need to lay off the horror movies. I had to leave tonight because they were playing Hellraiser 2 and it was just disgusting. I don't know if they are intentionally trying to run people off or what."}, {"date": "3/25/2018", "rating": 4.0, "content": "This dive bar is great, especially the back deck in the evening when the weather is cool and breezy. Sit back, relax, throw back a cocktail, and watch the workweek melt away."}, {"date": "1/3/2018", "rating": 5.0, "content": "Whoooo boy. Have i been drunk in here. Solid dive. Bartenders are cool and bootleg movies galore. Plus, dope pizza when you're shithoused. What's not to love? Park on 7th to save yourself a hassle on busier nights. Parking is way easier."}, {"date": "12/1/2017", "rating": 5.0, "content": "It is what it should be. I love the cult classic movies they run. Gives us loners some entertainment on a night out. When I'm with friends, the patio is tops and via313 is a must try if you've never had it."}, {"date": "9/24/2017", "rating": 4.0, "content": "As far as Austin goes the drinks here are reasonably priced. With all the hustle and chaos down on dirty 6th it is nice to be able to come down here and chill with friends. Though it can still get busy it is a much better alternative if you're looking to just hang and relax. I will admit that there isn't anything too special or unique about this particular venue but the atmosphere and people are chill. Bonus: Via 313 is right next door and has the most bomb Detroit style pizza ever."}, {"date": "5/3/2017", "rating": 5.0, "content": "They have great beer on draft. Great prices and good service with no pretentiousness. My favorite place, not to mention they have what I believe is the best pizza in Austin in Via 313."}, {"date": "4/29/2017", "rating": 3.0, "content": "This place is okay. Drinks are not very strong, but they are fairly cheap. This is the type of bar you would come to just to chat and maybe sit outside when you don't have a lot of cash to spend. Would probably go back, but not for a special occasion."}, {"date": "2/10/2017", "rating": 5.0, "content": "Drinks are good and strong! great place to relax adn unwind after a bus day! prices are good, seat is very limited but worth the visit."}, {"date": "2/6/2017", "rating": 4.0, "content": "Great drinks, great vibes, great prices. The place was pretty busy on a Saturday night, especially compared to Liberty which where I was at before here. There weren't any places to sit inside, so we opted for the outdoor. Not that many seats, but still a great place nonetheless.There's apparently a really good pizza truck that is right outside of this place. You really can't miss it. Heard it's suppose to be amazing pizza after an amazing night out."}, {"date": "1/26/2017", "rating": 5.0, "content": "I love this bar. It's cheap as hell and the bartenders are always friendly!! All of us over at Kemuri come down like every night after work cuz we really adore it. Plus via 313 is also terrific!!"}, {"date": "1/20/2017", "rating": 5.0, "content": "Drinks are cheap, including wells and the frozen alcoholic dreamsicle and solid to great craft beer! The atmosphere is pretty solid with fairly friendly people and busy most nights - even week nights. They also have Via313 outside which is some of the best pizza in Austin.This place is just a good balance of a lot of solid to great things."}, {"date": "1/17/2017", "rating": 4.0, "content": "A cool little joint with a divey feel. It is seriously dark inside which was perfect for my wife and I to have a couple of beer and a modicum of privacy. Their beer selection is solid and well-rounded if not extensive. The bartender was extremely friendly and prompt with service. Also, Via 313 has a food truck outside. This is the kind of un-pretentious place that I love. I will be back to get a beer and kill some time here next time I'm on the East Side."}, {"date": "1/11/2017", "rating": 5.0, "content": "Great place to go on the East Side.  Cheap Drinks, great bartenders, big patio and fun atmosphere.  They always have movies playing on half the tvs and the other half has cable.  They don't have a kitchen but don't worry, you can bring your own food and they also have a Via 313 food truck just outside that will bring pizza in to you.  I used to go to the Hideout Pub up north but since I moved downtown this is my new watering hole."}, {"date": "1/3/2017", "rating": 1.0, "content": "Really rude Bartenders. Went with a friend visiting from another country whose official state ID only includes his age and not date of birth. Even though he was obviously not under 21 and we had ordered pizza from via 313 next door, the bartender wouldn't even let us stay inside the building and was extremely rude about it saying it was \"TABC rules not mine.\" It was a Monday night and at all the other bars on east 6th we had no problems with the ID, unnecessary rudeness."}]}}, {"Hole in the Wall": {"name": "Hole in the Wall", "price": "$", "ratings": {"2016": [4.0, 4.5, 4.5, 4.0, 4.0, 4.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0], "2017": [3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.5, 3.0, 3.5], "2018": [3.5, 4.0, 4.0, 4.0, 4.5, 4.5, 4.5, 5.0, 5.0, 5.0, 5.0, 4.5], "2019": [4.5, 4.5, 4.0, 3.5, 3.5, 3.5, 3.5, 3.5], "2015": [4.0, 4.0, 4.0, 4.0, 3.5, 3.5, 4.0, 4.0, 4.0, 4.0, 4.0, 4.0]}, "hours": [{"Mon": "3:00 pm - 2:00 am"}, {"Tue": "3:00 pm - 2:00 am"}, {"Wed": "3:00 pm - 2:00 am"}, {"Thu": "3:00 pm - 2:00 am"}, {"Fri": "3:00 pm - 2:00 am"}, {"Sat": "3:00 pm - 2:00 am"}, {"Sun": "3:00 pm - 2:00 am"}], "info": {"Happy Hour Specials": "Yes", "Takes Reservations": "No", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No", "Accepts Google Pay": "No", "Accepts Cryptocurrency": "No", "Parking": "Street", "Bike Parking": "Yes", "Wheelchair Accessible": "Yes", "Good for Kids": "No", "Good for Groups": "Yes", "Attire": "Casual", "Ambience": "Divey", "Noise Level": "Very Loud", "Music": "Live", "Good For Dancing": "Yes", "Alcohol": "Full Bar", "Good For Happy Hour": "Yes", "Best Nights": "Thu, Fri, Sat", "Coat Check": "No", "Smoking": "Outdoor Area / Patio Only", "Outdoor Seating": "Yes", "Wi-Fi": "Free", "Has TV": "Yes", "Dogs Allowed": "Yes", "Has Pool Table": "Yes", "Gender Neutral Restrooms": "Yes"}, "reviews": [{"date": "8/1/2019", "rating": 5.0, "content": "So I ended up coming here on my 30th birthday in the hopes of meeting a tinder date for karaoke. Well, I got stood up, and still ended up having one of the best nights out solo I've ever had. There was a group sitting in the corner that sang German wwii propaganda songs, the KJ was singing hilarious bangers. Campbell, one of the bartenders, made my night. He served up drinks, cracked some jokes, showed some sympathy, sang some tunes, and just ended up making my night great. This is my new favorite karaoke spot, and I'm excited to start coming here on the regular."}, {"date": "7/26/2019", "rating": 5.0, "content": "Good dive bar. Always a live show going on during weekdays plus karaoke on weekends. Check in advance whos playing and if theres a cover. The bar is pretty big and has 4 main areas. There are two bars in the front each with a stage. Then there is an outdoor patio and a bar in the back. The bars in the front have a better selection of drinks. The patio is the best place to have a conversation. Usually theyll have karaoke and a band going on simultaneously.In terms of food, buffalo cauliflower and burgers are good. Its pretty standard bar food though. They have good week night specials in terms of drinks."}, {"date": "6/6/2019\n            \n\n\n\n\n\nUpdated review", "rating": 1.0, "content": "I would like to add that it's been four months since I posted my review and NOT ONE response from the company. I did however get a snarky response from the bartender in question, Campbell.I wonder if the company is just that clueless? Maybe they just have that much of an ego that they don't mind losing business?Wow, can't wait to keep avoiding this place."}, {"date": "5/11/2019", "rating": 5.0, "content": "Campbell is the kindest, most sincere bartender I've met in a long time. He's super quick and very sexy in a strange kind of way. Thank you \"Hole in the Wall\" for having him!!!"}, {"date": "4/5/2019", "rating": 2.0, "content": "Advertised for a free night of music and charged us a cover at the door, although 20 minutes later no one else had to pay to get in. I don't care about a cover but advertise fairly and don't make me walk across the street to get cash if that's not what you're promoting."}, {"date": "3/23/2019", "rating": 2.0, "content": "A bartender tonight with facial hair wearing a hoodie said \"I don't give a fuck\" to my friend. She was taking a video of the band and a busser picked up her drink. She looked around and it was gone. She went to the bartender in the middle bar and told him what happened. Tall single vodka soda in a pint glass.He then said \" I don't give a fuck, it has nothing to do with me.\" Got aggressive and pulled the drink he made from the bar. I'm not going to confront him. But I want to let the business know this guy needs new training. Please teach your bartenders proper etiquette when dealing with customers:"}, {"date": "2/8/2019", "rating": 3.0, "content": "Your typical grunge bar; photo booth is fun and the two guys playing guitar there were very talented. I wore my coat the whole time because the door was open and it was freezing out. Some college chicks were in the corner stacking up their shot glasses and taking pictures and the bartender kept yelling at people \"no politics at the bar.\""}, {"date": "12/29/2018", "rating": 2.0, "content": "Front bar: awesome. Middle bar: great music and bar Back (karaoke) bar: utter disappointment I moved here a few months ago and my coworkers told me this was THE place to go for karaoke. We planned our evening a week in advance and all we wanted to do was sing. The place was dead on a Friday night. Including the three of us, there were maybe 10-12 people including bartender and Dj. We put our names on the list with 4 people ahead of us. An hour and 15 min go by and I'm watching the same 5-6 people doing drunken versions of their favorites but never hear any of our names. I ask the Dj, after seeing a new list of three people without our names anywhere, and he tells me that if we wanna song we should have tipped him a $20 like all the people that went ahead of us. He tells us that tips are the only money he makes there, and if we don't tip, we don't sing. He then assured us we will go on next, this time, but in the future we have to pay per song if we don't wanna be skipped. Three songs later and of course, no mention of our names. I ask the bartender what the deal is and he tells me that's just how it is. So, instead of staying and spending more money on drinks, we left. I will never go back there. Completely ridiculous and disappointing for all of us. So much for the best karaoke in Austin."}, {"date": "11/24/2018", "rating": 5.0, "content": "Hayley in the back bar.  Runs in a superior gear.  If I owned a bar I'd give annual ownership bonuses to such type of tenders.   Rad"}, {"date": "8/24/2018", "rating": 5.0, "content": "The karaoke was the best part about this place. If you don't want to pay the cover charge you should enter from the rear part of the bar. It's a cool hangout spot with friends."}, {"date": "7/30/2018", "rating": 3.0, "content": "Located on Guadalupe across from the university this place is the best place to get away from he summer heat for a cool brew that will give you time away from all the tourists or locals . in fact it was not over crowded for happy hour 3-8 pm i believe and the music was amazing . Doesn't conform to today's standards of posh . More how a band would frequent to allow creative juices to flow for lyrics. Great venue for bands too! Wish it had more choice beers on tap though !"}, {"date": "7/28/2018", "rating": 5.0, "content": "Awesome old skool dive bar.  Seems like a real nice spot to hang out and have a few drinks.  Place is kinda divided up into different sections.  Front room with bar., back area to see a band, patio out back, and a 2nd bar area in the back.  Will miss the back area bar unless you get up and explore."}, {"date": "7/26/2018", "rating": 5.0, "content": "Great place and really surprising.  Shitty Lemonade is great.  The prices she good n variety of music is great. I like this place n chill n frills atmosphere.  It is a Hole in the Wall but a fun one!!"}, {"date": "6/14/2018", "rating": 5.0, "content": "Say what you will about Hole in the Wall, but this place has the coldest, crunchiest ice."}, {"date": "5/25/2018", "rating": 5.0, "content": "This dive bar is the best of the best! I stopped in this evening and was greeted by the friendliest bartender on the planet. Since school's out for summer, it was easy to snag a table and enjoy a beer. Win!"}, {"date": "5/24/2018", "rating": 5.0, "content": "I am not a vegan. That being said, I was fully prepared to hate this place on sheer principal, but damn it, it was pretty darn tasty. I got the faux chicken tacos, which more or less had a similar consistency of egg or soft ground chicken. The taco it self was built like a fish taco with a spicy mayo, and a slaw of lettuce with lots of vegetables. Whatever, it was good, it gets 5 stars because I was very surprised that I didn't hate it as I do with most vegan faux meats and cheeses.Would a regular meat taco be better? Yes of course, however, I have had worse real tacos. If you are at Hole in the Wall, it is worth getting. The tater tots are on point."}, {"date": "2/28/2018", "rating": 5.0, "content": "My friend and I went to Hole In the Wall groups were performing at Austin over the weekend and it was amazing! We wondered why we haven't been to a show here before and while there went on their site to look at upcoming shows, and booked another one!We went early so we could also try the food. If you go to a 7pm show, they open the doors at 5pm so you can go in and hang out at your seat, having some eats & drinks. No draft beer, but they had a good selection of bottled & canned craft beers for $7 a pop...Founders Dirty Bastard, Warpigs Lazurite IPA, FFF Alpha King, Epic Tart N Juicy Sour, Spiteful Working for the Weekend - just to name a few.Our server was always there when we needed to order something, well informed and decently friendly making for a good eat in experience. The Burrata was excellent! We ended our feast with the Salted Candy Bar dessert that had milk chocolate ganache, salted pretzel croquant, black fudge sauce, almond nougat and fudge cake. Indulgent and enjoyable with allthe chocolate goodness melding quite well together.All in all food wise, loved the burrata, enjoyed the dessert, but I'd probably skip having a full meal here pre-show in the future.Now seeing a show here? It's ideal. Amazing sound and there's no bad seat in the house but seeing an artist you like in the front seats is UNREAL! It's such an intimate venue so I just fell in love with it. As I mentioned, we've already booked tickets to go back!"}, {"date": "2/4/2018", "rating": 5.0, "content": "Awesome place with a great staff. I was dropped nearby after my megabus from dallas to San Antonio broke down south of Waco and I grabbed a lyft with 4 strangers. The lady at the front waved my cover and the bar tender Melissa was a delight. The band playing (possibly sabbath crow?) was kickass. The Hole In the Wall was a nice end to a rough day."}, {"date": "1/12/2018", "rating": 5.0, "content": "Love this legendary bar!! Cam, Austin, Laurel, Kelly and Lyn are the best!! I spend way too much money here, lol!"}, {"date": "12/27/2017", "rating": 4.0, "content": "We were staying in Austin and wanted to check out some music. After looking up bands playing, the one at Hole In the Wall seemed perfect for our taste. We arrived a tad early and a small group was there so we sat at the bar. The bartenders were extremely friendly and recommended great choices in drinks. The band started quite late past the posted start time but their set was great. Parking was easy to find on the street a block awayPrices were good - it was a small cover for the band Go for the music, stay for the friendly bar atmosphere"}]}}, {"Upstairs at Caroline": {"name": "Upstairs at Caroline", "price": "$$", "ratings": {"2017": [3.5, 4.5, 4.0, 4.5, 3.5], "2018": [4.0, 4.0, 3.5, 3.5, 3.5, 4.0, 4.0, 4.0, 4.0, 4.0, 3.5, 3.5], "2019": [4.0, 4.5, 4.5, 4.5, 4.5, 4.0, 4.0, 4.5]}, "hours": [{"Mon": "4:00 pm - 12:00 am"}, {"Tue": "4:00 pm - 12:00 am"}, {"Wed": "4:00 pm - 12:00 am"}, {"Thu": "4:00 pm - 12:00 am"}, {"Fri": "12:00 pm - 2:00 am"}, {"Sat": "11:00 am - 2:00 am"}, {"Sun": "11:00 am - 12:00 am"}], "info": {"Happy Hour Specials": "Yes", "Takes Reservations": "No", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No", "Accepts Google Pay": "No", "Parking": "Garage", "Bike Parking": "Yes", "Wheelchair Accessible": "Yes", "Good for Kids": "No", "Good for Groups": "Yes", "Attire": "Casual", "Ambience": "Hipster, Casual, Trendy, Classy", "Noise Level": "Loud", "Good For Dancing": "No", "Alcohol": "Full Bar", "Good For Happy Hour": "Yes", "Best Nights": "Fri, Sat, Sun", "Coat Check": "No", "Smoking": "No", "Outdoor Seating": "Yes", "Wi-Fi": "Free", "Has TV": "Yes", "Dogs Allowed": "Yes", "By Appointment Only": "No", "Has Pool Table": "Yes"}, "reviews": [{"date": "8/12/2019", "rating": 4.0, "content": "Came to meet up around 10:30pm on a Friday night with my cousin before heading to dirty 6th. We got the key lime fizz and bad life choices. The key lime fizz was like a vodka lemonade. The bad life choices was a watermelon frosé with an everclear float. That drink was delicious!! Highly recommend. The atmosphere is casual with giant games and a pool table. The bar is inside of aloft hotel, so towards the back it becomes less of a bar and more of a hotel lobby- which was less fun on that side. It was packed though, so we sat on that side for a few minutes. The drink prices are fair and it's a pretty causal place. I think I'd have more fun coming in for a happy hour rather than in the evening at my age (young twenties), but not a bad place to hang with friends!"}, {"date": "8/11/2019", "rating": 4.0, "content": "I went here the other day and it seams like a nice quiet place. but then shortly the rush started to come in and it got loud and busy. was still great experience though"}, {"date": "8/10/2019", "rating": 5.0, "content": "This is a great place to hang out with a group. There are cornhole boards, giant jenga, lots of seating and a great environment. We had a group of 10 and service was quick! I got the lime fizz (i think that's the name) and several people in our group got a drink called a bad decision. Everyone's drinks were delicious! If you are looking for somewhere to go for a quick drink or to even just hang out with some friends and play some games this Ali's a great spot."}, {"date": "8/10/2019", "rating": 5.0, "content": "Great atmosphere. Staffed well. Was there during busy and slower times.  Never had to wait long to order or get a drink.  Recommend their Old Fashion. Original and delicious!"}, {"date": "8/9/2019", "rating": 3.0, "content": "Cute spot for drinks and light apps. The prickly pear marg was my fav! We stayed and played a few rounds of Jenga and then scooted off to the next place."}, {"date": "8/9/2019", "rating": 5.0, "content": "Love this place! A great spot in Austin day or night, excellent service & awesome food!"}, {"date": "8/7/2019", "rating": 4.0, "content": "Good for what it is - a fun hotel bar.  Jenga, corn hole and pool are essentials.  Also got some shuffle board and other board games on most days.  Happy Hour until 7pm with different options each week night.  Beer list pretty week but they have fire eagle which reminds me of most west sixth spots in selection.  Full bar and tons fo TVs and seats.  Gets busy after work but easy to find a spot to sit and get work done or just relax and drink post 8pm.  Good spot a bit north of downtown for drinks only and just some good outdoor fun.  Dogs allowed - always a plus!"}, {"date": "8/5/2019", "rating": 5.0, "content": "This place is so much fun. The atmosphere is friendly, the music is good and the staff is extremely helpful. They have games you can play such as an oversized connect four and jenga. They also have corn hole and board games. We had so much fun at this happening meeting place. It is also dog friendly. We were staying at the hotel and found this was a great place to start and end our evenings. They have indoor and outdoor seating too. Overall, great place to meet friends and have fun."}, {"date": "7/30/2019", "rating": 5.0, "content": "This is one of my favorite spots in Austin. Great service, knowledgeable bartenders. While not being able to make everything because of spirit selection what they do make is unbelievably enjoyable for the atmosphere there. Manager on duty (Katy) very welcoming helpful. Do yourself a favor and get interactive at UAC!!"}, {"date": "7/29/2019", "rating": 4.0, "content": "Fun! I like the checker board tables, the open area concept on the second floor. The guacamole & chips was pretty good that we ordered for a margarita chaser. It was pretty packed when we went on a Friday afternoon & the service was a bit absentminded, but polite & apologetic so we learned & ordered 2 drinks next time...kidding, I think"}, {"date": "7/26/2019", "rating": 5.0, "content": "ROD!!! Such an amazing bartender. He was very nice and informative. A bit funny too. The atmosphere is super nice and chill, excellent decor as well. Definitely come here and get Rod as your bartender! You won't be disappointed I promise."}, {"date": "7/26/2019", "rating": 3.0, "content": "Cool downtown 2nd story Rooftop/Lounge. On the downside, the food is pretty mediocre, they have very few beers on tap and the margaritas are ok. In all fairness, very few hotel restaurants in Austin have great food. My favorite restaurants in Austin are generally a few miles (1-3 miles) from Downtown (East Austin, South Austin, North Austin). Not the burbs! :) Needless to say, the Caroline Rooftop is situated in a really cool part of downtown and has a great vibe. It's a 3 star rating due to its ambiance. They have a bunch of games, dog friendly and a nice view of the downtown area.It's not a bad choice for grabbing a drink and then moving on."}, {"date": "7/25/2019", "rating": 5.0, "content": "Wow such a cute place and great atmosphere! The drinks were so good and I enjoyed it so much! Went there for a birthday dinner and it was delicious!"}, {"date": "7/23/2019", "rating": 4.0, "content": "Great 2nd story rooftop bar lounge to hang out Downtown for a breath of fresh air with entertaining yard games; perfect for HH. It's spacious and you shouldn't have trouble finding a seat as people are always in and out or up mingling.  An incident last month with my out of town friends- They ordered Hennessy in which the bartenders said they did not have so instead they ordered something else. I was disappointed as I knew the bar serves Hennessy as I've been here twice prior. I told my friends to hold so I can give the bartenders a friendly reminder that they do in fact serve it and they may be able to accommodate our original order. It may have been the lack of knowledge of inventory at the moment, I'm not sure. Either way, they didn't do anything about it. We ended up ordering another round of our initial preference and bites."}, {"date": "7/21/2019", "rating": 4.0, "content": "This is such a fun atmosphere, we stumbled across the rooftop bar while wandering the street. The bad decision is a great decision. The watermelon frose was just right. Absolutely will be back!"}, {"date": "7/17/2019", "rating": 5.0, "content": "This is the perfect place to spend Sunday funday! It is dog friendly and offer discounts when you bring your dog. The staff is friendly and fast. If you enjoy games & dogs this is going to be your favorite place!"}, {"date": "7/7/2019", "rating": 5.0, "content": "Rooftop bar where you can have food,drinks or coffee from downstairs. The place is so relaxing and they have board games too in case you're in a mood."}, {"date": "7/7/2019", "rating": 4.0, "content": "Lovely place to relax and play games with friends. It's in a terrace so it's not the best idea for really hot days. Try the Mexican iced coffee!"}, {"date": "7/6/2019", "rating": 1.0, "content": "The atmosphere was fun, but the sangria was terrible and expensive . It looked and tasted like a lemonade made from a mix. The only fruit was a blackberry that the bartender added before serving. I was disappointed."}, {"date": "6/26/2019", "rating": 3.0, "content": "Food selections were limited and overpriced.  Didn't find the street tacos all that appetizing.  Cool place to hang out and have a few drinks but don't arrive hungry.  Service at first was really slow.  I may try them out again."}]}}, {"The Little Longhorn Saloon": {"name": "The Little Longhorn Saloon", "price": "$", "ratings": {"2016": [4.5, 4.5, 5.0, 5.0, 5.0, 4.5, 5.0, 5.0, 5.0, 4.5, 4.5, 4.5], "2017": [4.5, 4.5, 4.5, 5.0, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5], "2018": [5.0, 5.0, 5.0, 5.0, 4.5, 4.5, 4.0, 4.5, 4.5, 4.5, 5.0, 5.0], "2019": [5.0, 5.0, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5], "2015": [4.0, 4.0, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5]}, "hours": [{"Mon": "            Closed"}, {"Tue": "5:00 pm - 11:00 pm"}, {"Wed": "5:00 pm - 11:00 pm"}, {"Thu": "5:00 pm - 1:00 am"}, {"Fri": "5:00 pm - 1:00 am"}, {"Sat": "4:00 pm - 1:00 am"}, {"Sun": "1:00 pm - 9:00 pm"}], "info": {"Takes Reservations": "No", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No", "Accepts Google Pay": "No", "Parking": "Private Lot", "Bike Parking": "Yes", "Good for Kids": "No", "Good for Groups": "Yes", "Ambience": "Divey", "Noise Level": "Loud", "Music": "Live", "Good For Dancing": "Yes", "Alcohol": "Beer & Wine Only", "Good For Happy Hour": "Yes", "Best Nights": "Wed, Sat, Sun", "Coat Check": "No", "Smoking": "Outdoor Area / Patio Only", "Outdoor Seating": "Yes", "Wi-Fi": "No", "Has TV": "Yes", "Has Pool Table": "Yes"}, "reviews": [{"date": "7/11/2019", "rating": 5.0, "content": "Love this unique piece of Austin! Looking for something fun, hilarious and over all blast to do on a Sunday- check out Chicken Shit Bingo! Yes that's what I said... lol and it's totally kid friendly, as well as I brought my 78yr old parents, aunt and uncle from out of town- We all had a blast! Definitely a thing we will do w any out of towners to show them something very \"Austin!\" Side note- bring cash and be prepared because it gets really crowded, parking is limited."}, {"date": "7/3/2019", "rating": 5.0, "content": "Place is so.much fun everytime im there. Blues one night. Yodeling another. Chicken shit bingo on sunday morning. Place doesnt need a juke box theyre always having a good time. Beer n wine only heads up"}, {"date": "6/4/2019", "rating": 5.0, "content": "Best dive bar in Austin! Great band, friendly staff and patrons, and great Texas country western ambiance.  Love dancing to the live band although the dance floor is tiny. Also, be warned - they only serve beer and wine. But if your looking for a truly Austin, Texas dive bar experience look no further! Had a great time and will definitely return."}, {"date": "5/19/2019", "rating": 3.0, "content": "Save to WishlistOne of Austin's best-kept secrets is The Little Longhorn Saloon, For over 40 years, and on Sundays, the bar hosts one of Austin's weirdest weekly events: Chicken Shit Bingo.Chicken Shit Bingo started when a local musician approached the bar's previous owners, with an idea he brought back from California. There, he had seen cow shit bingo, but he suggested using chickens instead. Their response was: \"It's never gonna last.\" Today, the 25-year tradition would suggest otherwise.Chicken Shit Bingo is part of the nostalgia and history of the bar. The bar now serves a large assortment of wines and champagnes, plus 80 different types of beer other than drafts. And in keeping with the times, the saloon now accepts credit cards--not just cash.The best part of the game is the excitement of the crowd, especially the children: \"Chicken Shit Bingo is about the camaraderie and the fun.Between 4 pm and 8 pm, locals gather for a unique version of bingo involving chickens, chicken feed, and what chickens do after they eat. All ages are welcome to both watch and participate in this event, which you have to see to believe. For a donation of $2.00, participants purchase a ticket in line: children 13 and younger go first, and adults aged 92 and older go second.Once all the tickets are gone, the first of four rounds begins. Each ticket corresponds to a number on the table, and if the chicken eliminates on your ticket's number, you win a cash prize. The Chicken Shit Official tells the band the winning number, and they, in turn, announce it on stage. Winners have their photos taken, and the next round begins!A valid I.D. is required to purchase alcohol, and you must be 21+ to drink. Sodas and other non-alcoholic beverages are also available. To really experience the dive bar like a local, pull up a bar stool and enjoy an ice-cold Lone Star beer while you watch or play along!"}, {"date": "4/9/2019", "rating": 4.0, "content": "Sunday funday for the chicken sh** bingo is where it's at!! So fun! We got there right before their last round. It's gets crowded but everyone was having a good time and excited for the chicken to come out. It's entertaining for sure!"}, {"date": "3/13/2019", "rating": 1.0, "content": "I used to be a fan of this place, but I had an unpleasant run-in with a drunk male patron about a month ago, and have contacted the business multiple times since with no response.During busy times like Chicken Shit Bingo, the line for the women's restroom is extremely long, while the men's line is one or two people. Of course, this is because women take longer in the bathroom. There is no reason to make women wait twenty minutes in front of a blaring speaker to pee while men can just walk straight in.On this day, the women's line had about ten people in it, so I stood in the men's line, which no one was in. A drunk man came up and stood in front of me and wouldn't move. He dramatically pointed out that it's the MEN'S room, to which I replied that this is completely arbitrary and there's no reason to demarcate them that way if only one person can use it at a time. I really needed to go. He eventually relented, but kept banging on the door while I was in there. It was unpleasant and so unnecessary. At least one other man gave me shit about it also.This issue could easily be alleviated by not gendering the bathrooms, which would also make the space more welcoming to trans and non-binary people. There is absolutely no reason to assign a gender to these single-stall bathrooms, and thus there is no reason for the saloon to not be accommodating to women and other people who would be helped by simply removing the gender signs from the bathroom doors. One star for the lack of reply, which indicates that this business doesn't care about addressing the needs of its patrons."}, {"date": "3/10/2019", "rating": 5.0, "content": "Had a great time at the Little Longhorn Saloon!  Enjoyed 'chicken shit bingo' on a Sunday afternoon, and stayed a little longer to listen to the superb live band.  Good beers, good atmosphere and a friendly vibe."}, {"date": "2/23/2019", "rating": 5.0, "content": "Great prices (even better during happy hour), great beer selection and some of the coolest bartenders around. If you're in the area and looking for a place to drink make this you're choice. I'm a first timer but I'll definitely be back."}, {"date": "2/17/2019", "rating": 5.0, "content": "We love this place, has live music everyday except on Mondays because its closed.We live close by but I consider this place crown jewel of honky tonk, would not trade it for any other place.We may even celebrate our wedding there that is how much we love the place and Terry is the greatest as is her staff.You are missing out if you don't drop in at least once, but once you do you will be going back I guarantee it."}, {"date": "2/7/2019", "rating": 5.0, "content": "This literally by far the best bar we went to while we visited Austin! The place was packed for chicken shit bingo, which is hilarious and not expensive to test your luck. We got lucky! We won at our first go! We met a couple of the locals who were amazing and sweet, they allowed us to sit at their table while we drank our bucket of beer. If I come back to Austin I will definitely make a trip back to the little long horn saloon."}, {"date": "1/25/2019", "rating": 5.0, "content": "Awesome bar, great music. Amazing customer service. Good place to two step. The owner came through and greeted all of her customers with a warm heart. The beers a coooooold."}, {"date": "1/20/2019", "rating": 5.0, "content": "Came up to Austin from San Antonio just to be lay some Chicken Shit Bingo. There were lots of people but there is space outside for the overflow. Seemed to be lots of out of towners. Good prices on beer and a good time."}, {"date": "11/18/2018", "rating": 5.0, "content": "Chicken shit bingo. Cheap beers. Live music. Good company. Enough said. Definitely our cup of tea."}, {"date": "10/26/2018", "rating": 5.0, "content": "Went there for the the beer, and the chicken shit competition.  It was great .   Brought our 5 year grandaughter and she loved it.  See te pictures  below."}, {"date": "10/21/2018", "rating": 5.0, "content": "Finally crossed chicken shit bingo off my bucket list.  If you are in Austin, you should definitely stop here."}, {"date": "9/14/2018", "rating": 4.0, "content": "Cheap beers and dance classes. Interesting folks who are friendly and talkative. Quintessential old Austin."}, {"date": "9/2/2018", "rating": 5.0, "content": "Very cool! Very Austin! I was invited by a friend, I did not know about it but came to see chicken poop on a bingo cartoon and have some beer, listen to awesome live music!!!! Did not eat but enjoyed the beer, music and festive ambiance! We had a blast!!! I believe the bingo is every Sunday! Worth the trip and planning for it!"}, {"date": "8/30/2018", "rating": 5.0, "content": "best place in town to find austin's musical treasures. @thelittlelonghorn is keeping the spirit of live music alive. thank you terry, david, diana, and all the gaona's! you're making your mark. i can vouch thursday's with ALVIN CROW alvincrow.com.  i sh*t you not, history is made and your soul will be revived. every thursday night. #freetogetineverynight."}, {"date": "8/16/2018", "rating": 4.0, "content": "Just one of those old Austin gems you need to get to. Fast.The Little Longhorn - Ginny's to everyone I know - is so unpretentious you can drive by again and again and never see it. So put the address in your GPS and make it a point to stop in one night.Yes, the place is small and the parking limited (welcome to Austin) but if you have more than two drinks you ought to be using Uber (or Ride Austin actually) anyway. There's a street-side front door but regulars often come in the back because, a.) it opens directly to the restrooms, and, b.) the front door is literally next to the band. If they're in session and you walk in crooked (get that Uber boy) you will bump into the guitarist.For a tiny place the seating has been optimized: a railing with ledge along one wall, a bar, and tables too. You can get in here. When you do get in this is what you find.Friendly people of all different types: blue collar, white collar and no collar. Diversity in age and ethnicity. Old and young alike. Getting the picture? Everyone is friendly here. And most folks have enough sense to bus their own tables when leaving - there's a big old blue recycling bin easily accessible at the end of the bar - because mist people here are not so stuck up they need to underline that by leaving their detritus on a table and make the happy - and harried - bartender run around and pick up after others!Remember your server.You get good music - maybe blues, maybe Americana, maybe something else - by a variety of artists played with enthusiasm and lots of talking back and forth with the crowd. And you get those restrooms. By the way, while I don't know about the women's the men's room is clean and better lit than the bar!Drinks are reasonable, the bartenders friendly and it's just hard not to have a good time here.Why only four stars? It's really just the size - at times you just can't get in, so that's a bit of a bummer. But I that's the only downside, I'd say its more like 4 1/2 stars.So treat yourself right. And go."}, {"date": "8/3/2018", "rating": 5.0, "content": "Classic Texas little spot to hangout and enjoy a drink and music. Have to catch \"chicken sh!t bingo\" on Sundays. Take the kids and teach them to gamble early! Hot as heck in the summers so if you come for bingo try to hit a cool front when it's only in the nineties."}]}}, {"The Barn": {"name": "The Barn", "price": "$", "ratings": {"2018": [5.0, 5.0, 5.0, 5.0, 5.0], "2019": [5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0, 5.0]}, "hours": [{"Mon": "3:00 pm - 12:00 am"}, {"Tue": "3:00 pm - 12:00 am"}, {"Wed": "3:00 pm - 12:00 am"}, {"Thu": "3:00 pm - 12:00 am"}, {"Fri": "3:00 pm - 12:00 am"}, {"Sat": "11:00 am - 12:00 am"}, {"Sun": "11:00 am - 12:00 am"}], "info": {"Accepts Credit Cards": "Yes", "Wheelchair Accessible": "Yes", "Good for Groups": "Yes", "Noise Level": "Average", "Music": "Live", "Good For Dancing": "Yes", "Alcohol": "Beer & Wine Only", "Good For Happy Hour": "Yes", "Best Nights": "Sat", "Coat Check": "No", "Outdoor Seating": "Yes", "Has TV": "Yes", "Gender Neutral Restrooms": "Yes"}, "reviews": [{"date": "8/1/2019\n            \n\n\n\n\n\nUpdated review", "rating": 5.0, "content": "Lots has changed since it's opening in terms of drinks. There's now a full bar, a better craft beer selection, and a frozen margarita machine. Cornhole league plays on Wednesdays.It's still a hole in the wall kind of place but with more offerings!"}, {"date": "6/8/2019", "rating": 5.0, "content": "Stopped by to listen to Blues legend WC Clark perform in a small venue. From the moment we arrived we felt the unique vibe of a South Austin beer garden with food trailers in the lot and a modest $5 cover to have front row seats and a night of unbelievable musical talent. Beer and wine was modestly priced. Mike greeted us at the door and was a terrific host. Service was a little slow... but somehow it felt perfect to go along with the comfortable surroundings. We plan to visit again soon!"}, {"date": "6/2/2019", "rating": 5.0, "content": "Great bar. Excellent outdoor area with some good food trucks that give a great variety if food options. They have great live music on most nights and weekend days. The last time I was there was Sunday day. The new bartender they hire was great and provided excellent service. The place is dog friendly too. I highly recommend  The Barn."}, {"date": "6/1/2019", "rating": 5.0, "content": "Was looking for a cold beer while waiting to meet up with a friend. Found this on Yelp, was almost deterred by so few reviews but they were all five stars. Came to check it out and it's fantastic! Had to drop another review to attract more here- they haven't been open long but have an awesome set-up. Tons of space, great layout, super clean and good vibes.Family owned and run- the bartender gave me a few beers to try and clearly knows his stuff, not to mention knows the vendors and breweries, which I always respect.Delicious cold beer, they also have wine and white claw. Highly recommend- my favorite beer garden find in Austin!"}, {"date": "4/28/2019", "rating": 5.0, "content": "A great spot for a beer and fun! Played jenga and bean bags outside while enjoying delicious local Texas beer! Worth a trip!"}, {"date": "4/19/2019", "rating": 5.0, "content": "This is one of the best places we have ever been to to have a drink and hang out with friends. The Barn doesn't pretend to be something fancy. It's a place to just lay back, relax and enjoy the draught beers after a long day at work. There's plenty of comfortable outdoor seating thanks to a million trees. A pool table, open spacious layout and occasional live music occupy the interior of the building. Pair that with several food trucks available outside and you have yourself a decent evening out. We have seen 2 may be 3 bartenders during our time and they have all been very  polite and attentive. The biggest advantage for us is it's proximity to our residence that all but guarantees that we can have a good time without the need to worry about getting home afterwards. We have been here several times already and shall continue to support this business for as long as we can."}, {"date": "1/21/2019", "rating": 5.0, "content": "This is the cutest spot.  Totally unexpected.  Does not look like its pictures which do not do it justice at all.  I went for the Texas Lovebird show.  It was great!!  Don't miss them when they come again.  The music is great and they are fun and funny.  Moving songs too. The food from the food trucks was delicious.  (I had the Tom Kha Gai soup from the Thai truck.  Other friends raved about the jerk chicken from the other truck.)Inside, the folks could not be friendlier!  It was all just perfect!"}, {"date": "12/21/2018", "rating": 4.0, "content": "Nice vibes and a good beer selection ! It was a very slow night which Can be a good or bad thing. We had a few beers and listened to a live band. They had some food trucks out front which I'm sure would be great for a late night snack or two!"}, {"date": "12/2/2018", "rating": 5.0, "content": "I hardly get any time to leave reviews on yelp, but I promised my server I would leave a great review in return for the great service and I am a man of my word unfortunately it took a little longer than he was hoping for I'm sure.  I was impressed by his chivalry when he declined the opportunity for me to add his name in the review! THESE are they kind of employees I want working for me! Not to mention the great atmosphere, live music, pool tables it's just an all-around awesome dive!"}, {"date": "9/7/2018", "rating": 5.0, "content": "Great bar! The outdoor patio is great on a sunny day if you want to get out and read. The staff is very friendly as well. Good prices on the beers, hoping they will get taps soon."}, {"date": "8/11/2018", "rating": 5.0, "content": "Came in after driving by for a few months and I think I've found my new watering hole. Staff is super friendly and the vibe is funky chill with a touch of Willie. Family friendly with games inside & out. 3-4 food trucks covering crepes to Soul food will keep your bellies full. It's only been open for six months so get your tail here now so you can be one of the originals!!!!"}, {"date": "8/10/2018", "rating": 5.0, "content": "I was lucky enough to find this hidden gem. While stopped for traffic on Brodie Lane (in Sunset Valley) I looked to my right at the food trailers parked in the lot. Just passed my view I saw neon signs and one that said BAR. This beautiful undiscovered oasis in the desert is called the BARn. It has a great divey feel to it, wide-open spaces, a pool table, televisions,  an outside beer garden and a wonderful variety of canned and bottled beer. It also does not have your typical red or white wine, you actually get a few choices.Its also kid and pet friendly too and it's a really a wonderful place for the whole family. They also have live music from Thursday to Sunday and from what I understand WC Clarke will be playing there soon. Look for Allyson, she is as smart as she is cute. She made me feel so welcome and is appreciative when people come in. I'm looking forward to spending a lot more time and winding down at the BARn.P.S. The other cool part is you have the food truck park right next-door. It's a win win win situation!"}, {"date": "7/8/2018", "rating": 5.0, "content": "We brought a crowd of about 30 on a Saturday afternoon and (w/ some advanced notice) Mike, Mia and Dennis made it a great day! Great space with several different sections depending on what your in the mood for - outside bag toss, food trucks, pool/darts, TV's with whatever game is on. Lots of misters and fans to keep cool outside. Thanks to the whole staff for making it a great experience!"}, {"date": "4/29/2018", "rating": 5.0, "content": "This place is really cool. Local owned. Music Thursday, Friday, Saturday and Sunday for sure the owners are working on having live music other nights too / but just opened in October. They have food trucks right here so depending on what you are hungry for order your food at the food trucks and they will bring it to you as you enjoy a cool beverage .  Currently they only serve beer, AE ciders, wine and yummy alcoholic slushes and mimosas but full bar will be in the future."}, {"date": "4/21/2018", "rating": 5.0, "content": "Great spot! Family-owned and quaint. This repurposed house-turned-bar is our new Austin hangout. There's a ton of outdoor seating, amazing food trucks, and friendly staff. My husband and I enjoyed some pool and darts while sipping on some local beers."}, {"date": "2/15/2018", "rating": 4.0, "content": "I really enjoy The Barn!  I've gone a couple of different times now, and the locals are great.  We were given a tour of the place and shown the upgrades that are in progress including a pool table and dart boards (can't wait for that!).  We went on a particularly cold evening, and the real fireplace at the front of the bar was super cozy and they kept it on for us until closing time.  (The bartender is super friendly and easy to talk to).  The back patio is really pretty with lots of places to sit under big trees and colorful yard lights (think mini-moontower).  I can't wait to see what they do with the actual barn that's part of their property.  They offer curling lessons which is keeping Austin weird (love that!), but I doubt I'll participate as the classes are in the mornings.  I think everyone in south Austin should go out and support the newest drankin' place.  Oh, and they have food trailers out front!  I haven't eaten anything from them yet, but I have seen other people eating the barbecue, and it smelled delicious!"}, {"date": "2/15/2018", "rating": 5.0, "content": "This place is great. It's the definition of the OLD STYLE AUSTIN. Just a down home feel. They have live music, wine, beer, and now you can shoot pool. They have very large TVs to check in on the game. They have food trucks too. Soul of a Hick had some good fried chicken, and Louie's Bbq is good as well. You should check it out. The prices are very reasonable for the drinks and the food."}, {"date": "1/28/2018", "rating": 5.0, "content": "This place is cool.  Live Music.  Beer.  Wine.  Games.  Food trucks.  Come hang out and socialize!  Keep it simple and weird."}, {"date": "12/1/2017", "rating": 5.0, "content": "Great family run bar with good beer and good food trailers! Lots of outdoor space as well."}, {"date": "11/17/2017", "rating": 5.0, "content": "Oh my goodness! This place just opened up 2 weeks ago!!! Love it! Great food trucks, love the cute bar. Reasonably priced. Love music on Thursday, Friday & Saturday. Man where have you been?! Out side & indoor seating. Coming here as much as i possibly can :) love love love this!"}]}}, {"Continental Club": {"name": "Continental Club", "price": "$$", "ratings": {"2016": [4.5, 4.5, 4.0, 4.0, 4.5, 3.5, 3.5, 2.5, 2.5, 2.5, 3.0, 3.5], "2017": [4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.0, 4.0, 4.0, 4.0, 4.5], "2018": [5.0, 4.5, 4.5, 4.5, 4.5, 5.0, 5.0, 4.5, 4.5, 4.5, 4.5, 4.5], "2019": [4.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5], "2015": [4.0, 3.5, 4.0, 4.0, 4.5, 4.0, 3.5, 3.0, 3.5, 3.5, 4.0, 4.5]}, "hours": [{"Mon": "4:00 pm - 2:00 am"}, {"Tue": "4:00 pm - 2:00 am"}, {"Wed": "4:00 pm - 2:00 am"}, {"Thu": "4:00 pm - 2:00 am"}, {"Fri": "4:00 pm - 2:00 am"}, {"Sat": "3:00 pm - 2:00 am"}, {"Sun": "3:00 pm - 2:00 am"}], "info": {"Happy Hour Specials": "Yes", "Takes Reservations": "No", "Accepts Credit Cards": "Yes", "Accepts Apple Pay": "No", "Accepts Google Pay": "No", "Parking": "Street", "Bike Parking": "Yes", "Good for Kids": "No", "Good for Groups": "Yes", "Ambience": "Divey, Classy", "Noise Level": "Loud", "Music": "Live", "Good For Dancing": "Yes", "Alcohol": "Full Bar", "Good For Happy Hour": "Yes", "Best Nights": "Fri, Sat, Sun", "Coat Check": "No", "Smoking": "Outdoor Area / Patio Only", "Outdoor Seating": "No", "Wi-Fi": "No", "Has TV": "Yes", "Dogs Allowed": "No", "Has Pool Table": "Yes"}, "reviews": [{"date": "7/17/2019", "rating": 5.0, "content": "I really enjoy the shows here. The live music is great but show up early to grab a seat somewhere unless you enjoy standing. Either way this place always make for a fun night!"}, {"date": "7/4/2019", "rating": 2.0, "content": "The band we saw was Tom Ben somebody. Played some covers of Waylon and Willie and an original about his girlfriend with a glass eye. I'm not picky but this place has seen better days and is a dirty dump. Take a pass."}, {"date": "6/1/2019", "rating": 4.0, "content": "Had to pay a $7 cash cover but place wasn't too crowded. Live band was pretty okay but we hung out in the back to have an easier time talking. Eclectic group of people, quarter pay pool table, drinks were good. The female server who came to the back was attentive & overall was a pretty good time."}, {"date": "5/9/2019", "rating": 3.0, "content": "It's a very well known old club.  Nice and cool and dark.  Basic."}, {"date": "5/5/2019", "rating": 4.0, "content": "We came here to see Barfield the Tyrant. His style is considered Texas Funk. His show is very entertaining. The server, yes server as in one person, was super nice and very good considering she was serving potentially over 100 people at one time. Now the bad news. This place is FILTHY. The bathrooms are disgusting. The place overall needs to get a scrub down. I know people come here for the music but at the very least, provide them with a bathroom that was worse than using a porta-John."}, {"date": "4/17/2019", "rating": 5.0, "content": "Got a parking spot right out front and went in and enjoyed a couple hours of pure entertainment. We really appreciate the atmosphere and good drink prices. Yes, there is a cover charge, but top notch acts make it totally worth it. This was our first night in Austin and we got two shows, had a great time"}, {"date": "4/9/2019", "rating": 2.0, "content": "Went to the Continental a week ago. There was a band which went on at 6:30, second act at 10pm. Here's the weak link about this room. There is actually only seating (not counting the bar) for maybe 45 listeners. We got there at 6pm and every single seat was taken, and it was apparent that these listeners were there for the evening. So if you want to get a seat to watch a show, I have no idea what time you may need to arrive?I'd say go prepared to stand for the evening. Sound system was good, and they actually have an engineer mixing the shows, unlike many of the other Austin venues that wing it. The good news is that this club is in a good part of town, and you should feel safe walking in the evening."}, {"date": "3/10/2019", "rating": 5.0, "content": "This was one of my favorite parts about my trip to Austin. The music scene is incredible. We attended a blues night during our trip, and I was so inspired. The musicians were extremely talented and couples were dancing all night. There's no way you can sit still during the music, so we joined too! :)"}, {"date": "3/8/2019", "rating": 1.0, "content": "I think I just paid 10 bucks (earlier it was totally 20, so I'm getting a deal the bouncer said) to listen to one washed-out band sing a song dedicated to Willie Mays and then take you long to get off stage. Not sure if another band is playing, but also not sure whether I want to hear them or not based on that last performance. The atmosphere here is dark and depressing, but with a disco ball, bc everybody knows a disco ball means you're ready to PAR-TAY like its 1899. My guess is I'd have a much better time chilling with that girl who stopped me in the street earlier and asked if she could pray for me. We did. It would be cool if she were my guardian angel, but I doubt it. Her name was Brie. Like the cheese. But she didn't have any on her. She was nice and we took a cute, awkward selfie in the street together.Anyway, I'm only staying here longer because I'm pretty sure I won't get my 10 bucks back from the guy up front if I inform him that I wouldn't have paid to come here if I knew the music was just irredeemably godawful. Maybe watching some of these old, drunk people will be worth it. Nah, doubtful. First live music experience in Austin is much like the atmosphere as described above. I'm just a lone, weird disco ball in a dark, lonely world of ancient pseudo-debauchery, where its anybody's guess which will die next: me from boredom and my stubbornness due a sunk cost fallacy vs. One of the old people falling off a barstool vs each and every one of all of our dreams we've ever had...Taking bets now...just hoping to make back 5 of my dollars and then call it a wash. Eh, at least this one old guy in a cowboy hat is shaking maracas (hard to tell) really oddly with enthusiasm and it's kind of funny."}, {"date": "2/27/2019", "rating": 4.0, "content": "Outstanding venue. Staff was friendly and accommodating. Beer is cold. Drinks were good and the crowd was friendly. The act that we saw was a little weak which took away from it but overall we loved the place."}, {"date": "2/24/2019", "rating": 4.0, "content": "Dark. Dingy. Wonderful.I came here with a friend in late February to hear the Peterson Brothers. We arrived a little late and were only able to hear about 10 minutes before they started packing up to make room for the next act. During a conversation with the manager, we wondered why they didn't play until 9:30 and were told \"Everyone wants a piece of them -- and they are nice enough to visit with everyone -- so they leave the stage a little early so the next band doesn't get delayed.\"And that's just old school cool.In fact, the Peterson Brothers were so nice ... in addition to producing quite the jamming jam. (I think everyone will know who they are soon enough.)  Back to the venue... It's an institution, and it's one of the few that I know of that hasn't left its roots to accommodate a broader crowd. If I lived closer, I'd be a regular."}, {"date": "2/19/2019", "rating": 1.0, "content": "Speakers turned up too loud. Caused ear pain and distorted music. Why ruin something good?"}, {"date": "2/18/2019", "rating": 4.0, "content": "This one was a \"bucket list\" stop, glad we did it. A friend told us Red Voelkert was playing on Saturday afternoon and probably wouldn't be too crowded since it's a regular thing, so we thought it was a perfect idea. Well, he got one out of two....Red was playing but it was PACKED!! Beer was cold, bartenders and that one waitress were bustin' hiney to keep up with all the people and their drinks!! Quite a fun people watching place for sure. Some ....um....we'll say \"older folks\" were likely regulars and dancing up a storm on the dance floor. Some were great, some were a little over dramatic (c'mon y'all, do we really gotta hump somebody's leg? LOL), some were in their own world, and it was delightful. Music was great of course, but after a couple beers and such a tight crowd, it was time to move on down the road.  Worth a stop if you're ever down Austin way!!!"}, {"date": "2/10/2019", "rating": 5.0, "content": "Cajun music and cold beer at the Continental Club on a dreary Sunday afternoon in Austin.  Perfect!"}, {"date": "2/2/2019", "rating": 5.0, "content": "Great little dive bar! Affordable drinks and great music ! Small venue on South Congress with lots of history. We enjoyed the evening of live blues. Will definitely return!"}, {"date": "2/1/2019", "rating": 1.0, "content": "Well, I really was digging this place until the staff decided to not serve us and then came out of the bar while we were waiting for our Uber to shun us...My sister and I took my dad out because he's never been to Austin and he wanted to see some live music. The band was amazing, the drinks were great, and we loved the crowd. We decided to hop over to another bar to check out some more music. We ended up coming back to the Continental because my dad enjoyed it more than the other spot we had been. This is when things got weird. The band played some more amazing music and we were enjoying ourselves...tried to order some drinks...the bar tender went to go get the drinks, but then came back and said no. Yes, we had been drinking but not nearly enough to be cut off. Never in my life have I been cut off from drinking at a bar, ESPECIALLY with my father. It was really weird so we decided to leave. As we are waiting for our Uber some lady came out from inside the bar (who we had not seen or have been served by) and said \"I'm just looking out for you\". That would have been fine if we were trashed, but again, we were not. It was just very rude and I will not go back ever again due to the staff. The music was great though I will give them that."}, {"date": "1/29/2019", "rating": 4.0, "content": "Went to hear the Peterson Brothers last night. Love them. First time at this dive bar. It's so tiny and late opening the doors. My bourbon and Coke was $3 and delicious. No cover. The guys had a keyboard player who totally drowned out the bass and I could only last an hour at that volume. The place was jam packed by the time I left. Nice mix of people."}, {"date": "1/12/2019", "rating": 2.0, "content": "Good music but unless you are in the front half of the run, you are going to see a TV disrupting the show. This is a music venue. I have no idea why they feel they need to have a bright TV in a dark room."}, {"date": "1/4/2019", "rating": 4.0, "content": "My husband and I stopped here with a friend for a few drinks and conversation. They had a live band playing so we moved towards the back so we could hear each other. This place is an iconic dive bar from what I have been told and what you can read from others reviews. The bar/club reminds me of how Austin use to be before all the east and west coasters moved to Austin and try to reform it. I liked it and would definitely come back the next time i am in the SOCO area. Note they have beer, cider, and a full bar for your thirst needs."}, {"date": "1/3/2019", "rating": 5.0, "content": "A super fun bar with great live music!  Had a blast New Year's Eve with my Boyfriend David. So glad I yelped this venue as it didn't disappoint a former Memphis resident who self-admittedly is a bit of a music snob. :) once you live in a music town it's hard not to raise your standards. Austin has a great music scene from what I experienced at The Continental Club!!!"}]}}]